[
{"name": "Orient Macaw 32 Inch LED TV", "link": "/price/orient-macaw-32-inch-led-tv", "price": "Rs. 23,100", "image_link": "/public/data/images/thumbs/ad099edf3eb7c4fbab94b0c93841cff4.jpg", "description": "Orient Macaw 32 Inch LED TV comes with a wide variety of features that help provide its users with theatrical experience from the comfort of their homes. These features include black bezel/stand, effective refresh rate of 50 Hz, 720p HD resolution along with connectivity facilities such as USB ports and HDMI ports. This 32-Inch LED comes with a user-friendly manual and claim of durability that is backed up by a 1-year official warranty."},
{"name": "EcoStar 32 CX-32U576 LED TV", "link": "/price/ecostar-32-cx-32u576-led-tv", "price": "Rs. 25,999", "image_link": "/public/data/images/thumbs/5712df8dd932b9b1ba778a9db6f2b761.jpg", "description": "This 32-inch LED by EcoStar has many features and specifications that make it a worthwhile purchase for its users. These features and specifications include a built-in power cable, power consumption of 55 W, and surround sound. Along with these, it also has energy-saving features, a base stand, a user s manual as well as batteries for the remote. This one has a frameless screen which provides its users with a more magnified and better television viewing experience. With its high audio and video quality, it provides a cinematic experience to its viewers from the comfort of their homes. Its weight is 40 Kgs and comes with a brand warranty."},
{"name": "Orient Leopard 32 Inch LED TV", "link": "/price/orient-leopard-32-inch-led-tv", "price": "Rs. 27,000", "image_link": "/public/data/images/thumbs/9e7f6186b3e32b1efbb4f60634669c96.jpg", "description": "Orient Leopard 32 Inch LED TV is an economical purchase that provides its users with a wide range of features that enhance their experience. It provides vivid and sharp images owing to its resolution i.e. 720p (1366x768). Along with this, it also has 12W powered Dolby speakers that amplifies the audio quality. It can work on power as low as 50W and is therefore energy efficient. This model has an ultra thin profile that gives it a sleek and modern look. It also comes with a 1-year official warranty."},
{"name": "EcoStar 32 CX-32U575 LED TV", "link": "/price/ecostar-32-cx-32u575-led-tv", "price": "Rs. 28,300", "image_link": "/public/data/images/thumbs/55fb2e8313165e34ed5063d5839fd2a4.jpg", "description": "This LED by EcoStar has many unique and distinct features that together make it a worthwhile purchase for its consumers. These features include a resolution of 1366 x 768, USB connectivity for audio, video & images, 2 HDMI input ports, PC- input for audio and video, motion processing, and an A-grade panel. Apart from these, it also has a program memory of 199 channels and power consumption of 55W. The optimum operating temperature for the LED is 5 C ~ 40 C and the humidity level is 10% ~ 85%. Along with all these features, to make it more reliable for its users, it has a 1-year manufacturer warranty."},
{"name": "EcoStar 32 CX-32U573 LED TV", "link": "/price/ecostar-32-cx-32u573-led-tv", "price": "Rs. 26,899", "image_link": "/public/data/images/thumbs/0ff1e529bc6b9225b9a64d600bbb156a.jpg", "description": "This 32-inch LED by EcoStar has many features that work together to make it a cost-effective purchase. These features include 1366 x 768 of screen resolution, USB connectivity for audio, video and images, HDMI x2 and programmable sleep timer. Along with these, motion processing, image refinery as well as program memory of 199 channels and surround sound. With wide view angle and digital noise reduction, it provides it viewers with cinematic experience from the comfort of their homes. Moreover, it has power supply of AC 100-200 V. This LED comes with a 2-year warranty which enhances its reliability."},
{"name": "Akira 24MG102 LED TV", "link": "/price/akira-24mg102-led-tv", "price": "Rs. 19,999", "image_link": "/public/data/images/thumbs/8399c5af0a85d96e4a0a0d89bbc8753c.jpg", "description": "The Akira 24 MG102 is a budget LED TV. It has HD resolution for clear display, HDMI connectivity to connect your other devices. It has stereo sound and a beautiful look."},
{"name": "TCL 32 Inch Led Tv D310", "link": "/price/tcl-32-inch-led-tv-d310", "price": "Rs. 27,900", "image_link": "/public/data/images/thumbs/4538c03ac4db9673b7c4b066dec4aa13.jpg", "description": "D310 is a basic, non-smart, entry-level LED TV from TCL which comes with features of HD resolution, 32 inches display, and USB & HDMI connections. Natural Light Engine in this LED TV provides the brightest and highest contrast level to ensure true color reproduction. Turbo Sound enhances your entertainment experience and the USB & HDMI connections allow you to share your favorite data from different technologies and systems and display on your TV. Although it is not a smart TV, it is a good choice for the people who are on a budget."},
{"name": "EcoStar 32 Inch 32U563 LED TV", "link": "/price/ecostar-32-inch-32u563-led-tv", "price": "Rs. 24,000", "image_link": "/public/data/images/thumbs/15493090303e434059a3f7472a957b72f632a991a7.png", "description": "The EcoStar 32U563 is a budget LED TV that comes with the entry-level features that EcoStar has to offer. With a sizeable 32-inch HD screen, the Sound Max Engine, and the RealColor Engine, the LED TV can deliver a good picture quality, particularly for this price range. The sound is clear and natural whereas the colors are accurate but a little dull. Overall, if you are looking for a budget LED TV with an impressive screen size then the EcoStar 32U563 LED TV is a good choice for you to consider."},
{"name": "EcoStar 32 Inch 32U571 LED TV", "link": "/price/ecostar-32-inch-32u571-led-tv", "price": "Rs. 27,000", "image_link": "/public/data/images/thumbs/15492060143e6a5a507dc420622ffc6e9b00a69c9d.jpg", "description": "EcoStar is a reputed name in the electronics industry in Pakistan, particularly because of its budget-friendly LED TVs. The EcoStar 32U571 is a budget LED TV that comes with HD resolution, HDR, and USB connectivity to provide you with an all-in-one package. The Sound Max Engine coupled with the RealColor Engine ensure that the picture quality is crisp, clear, and sharp with life-like audio playback. Overall, the picture quality is impressive and this is a worthy choice if you are looking for an affordable LED TV for your home or office. There is no FHD resolution on board, but there is only so much that you can ask from this price range."},
{"name": "PEL 32 Inch HD LED TV", "link": "/price/pel-32-inch-hd-led-tv", "price": "Rs. 23,999", "image_link": "/public/data/images/thumbs/15493122403c79c984602a0dc97510ce4f84e11fa5.jpg", "description": "The PEL 32 HD also known as the PEL Coloron 32 is a budget LED TV that covers all the basics of LED TVs. With HDMI connectivity and USB connectivity, you can stream content from various sources on this PEL 32 HD LED TV. The picture quality is decent and the overall design is simple and clean as well. There is nothing much else to speak about with the PEL 32 HD, but if you are looking for a basic LED TV for watching and playing HD movies and games then the PEL Coloron 32 is a good choice."},
{"name": "Haier 32B9200M LED TV", "link": "/price/haier-32b9200m-led-tv", "price": "Rs. 31,275", "image_link": "/public/data/images/thumbs/15559640113e27f73c887dd2b7ab9d119402c4abc4.jpg", "description": "This is another, affordable option from Haier LED TV series with smart share capabilities. This smart TV delivers sharp and bright picture quality with its HD Ready technology and Miracast screen mirroring. With Auto volume leveler, the sound is streamlined so that all volume fluctuations during change of programs or television channels are eradicated. This television is also aesthetically pleasing and will make a nice addition to your living spaces."},
{"name": "EcoStar 39 Inch 39U563 LED TV", "link": "/price/ecostar-39-inch-39u563-led-tv", "price": "Rs. 31,000", "image_link": "/public/data/images/thumbs/1549308822bd6211976ec1324bc00e7a1ca8d31c87.jpg", "description": "The EcoStar 39U563, like its counterpart the EcoStar 39U564, is a budget LED TV from one of the leading electronics brands in Pakistan. The EcoStar 39U563 is a non-smart flat LED TV that is equipped with a vibrant 39-inch display, EcoStar's own Motion Reality and RealColor engines, and a Sound Max engine for boosting the sound performance. The picture quality of the EcoStar 39U563 is quite impressive with good contrast and excellent color reproduction. The only lacking is the FHD resolution, which should be a standard for all LED TVs in this price. Other than the resolution, the overall specifications and performance of the EcoStar 39U563 LED TV is on par with other LED TVs in this price range."},
{"name": "EcoStar 39 Inch 39U564 LED TV", "link": "/price/ecostar-39-inch-39u564-led-tv", "price": "Rs. 29,999", "image_link": "/public/data/images/thumbs/1549308874dc30341abbaacc07af8c792ae295cecd.png", "description": "The EcoStar 39U564 LED TV is a flat non-smart basic LED TV that covers all the essentials in one package. Whether you are looking forward to watching your favorite shows on cable or looking to stream content directly from your smartphone, the EcoStar 39U564 will have you covered. The Motion Reality Engine provides a smooth and lag-free experience whereas the RealColor Engine delivers great contrast and excellent color reproduction. It is not the best in terms of resolution or sharpness, but the overall performance and rich features of the EcoStar 39U564 make it one of the most reliable budget LED TVs out there."},
{"name": "Samsung 32 Inch 32K4000 LED TV", "link": "/price/samsung-32-inch-32k4000-led-tv", "price": "Rs. 29,550", "image_link": "/public/data/images/thumbs/36e2c251c70526c44919339bcf347144.jpeg", "description": "Enjoy Dynamic visuals, bright colors and vivid details with Samsung 32 inch HD Flat LED TV 32K4000. Its noise-reducing and Color & Contrast enhancing technology make you feel that you are in the middle of the action.. Bluetooth connection allows you to connect it with your phone and play your favorite playlist. You can display your favorite photos from your digital camera via USB connectivity. Samsung's Wide Color Enhancer technology displays the images as they were intended to be seen. This LED TV comes with different stylish looks. It has metallic legs that fit in the built-in holes, hence, making it perfect for bedtime. It doesn't have messy wires and has a unique, clean, and stylish design. 32K4000 lacks smart features but it is a good choice for the people who are on a budget."},
{"name": "Akira 39MS1303 LED TV", "link": "/price/akira-39ms1303-led-tv", "price": "Rs. 40,999", "image_link": "/public/data/images/thumbs/db36e62c690dfe8b5aae150d9d4deffc.jpg", "description": "The Akira 39 MS1303 is a Smart LED TV. Although its resolution is on the lower side with 720p HD but its build quality and Smart features make up for it. Overall a great TV with viewing options of Netflix and YouTube, connectivity options of HDMI and USB, a built-in Sound bar, and a slim & sleek pretty design. Cut short, simply pleasing."},
{"name": "TCL 32 A3 LED TV", "link": "/price/tcl-32-a3-led-tv", "price": "Rs. 39,999", "image_link": "/public/data/images/thumbs/43fc0d79b662a6c84795c68d124db399.jpg", "description": "TCL 32 A3 is a smart Android powered Smart TV capable of smart features. It packs a 32-Inch HD screen with a resolution of 1366 x 768 pixels. Although the display is HD, the best part of the TV is the Android OS which lets you explore a whole lot of viewing options including Netflix and YouTube. The HDR 10 on this device optimizes the colors of scenes to enhance your viewing experience."},
{"name": "Akira 39MG4013 LED TV", "link": "/price/akira-39mg4013-led-tv", "price": "Rs. 40,300", "image_link": "/public/data/images/thumbs/da5d1b2404f76d1923d73749534093d5.jpg", "description": "Akira's 39 MG4013 is a large and pretty LED TV. It has HD resolution for great display quality. Although it doesn't have smart features, It does have all the ports like HDMI and USB to connect your other devices and watch things on a larger screen. It's great sound system and beautiful look also contributes in providing a great overall experience."},
{"name": "Samsung 40 Inch 40N5300 LED TV", "link": "/price/samsung-40-inch-40n5300-led-tv", "price": "Rs. 39,870", "image_link": "/public/data/images/thumbs/a92045101c27493783314289d20bd862.jpg", "description": "Experience the best innovation with the Samsung 40N5300 LED TV. This Samsung LED TV comes equipped with a 40-inch display, Full HD resolution, 2 HDMI Ports, and 1 USB port. The large FHD screen provides a crisp and clear image with brilliant details. Micro Dimming Pro enhances the sharpness and depth of the color. HDR technology in this LED enhances the clarity and Ultra Clean View reduces the distortion. HyperReal Engine optimizes the picture for a perfect visual experience and Pure Color technology makes you feel that you are in the middle of the action. Enjoy the superb sound with 40N5300 because of Dolby Digital Plus audio technology. Samsung Cloud feature helps to sync your phone's gallery to the TV while the Ethernet port provides an easy, stable, and high-speed connection to the internet. Furthermore, this LED TV is designed to add beauty to your interior."},
{"name": "Ecostar CX-32U870 32 Android LED TV", "link": "/price/ecostar-cx-32u870-32-android-led-tv", "price": "Rs. 38,150", "image_link": "/public/data/images/thumbs/35a33a3b69c5085d06cedf944df908be.png", "description": "This android LED TV comes with many different features and specifications. These features and specifications include frameless design, screen resolution of 1366 x 768, Mali 450 quad-core, android 9.0, built-in Wi-Fi, and LAN. Along with these features, it has 1 GB RAM and 8 GB ROM. Moreover, it has built-in apps with Google Play along with preinstalled ones that include Netflix, YouTube, Prime Video, and Google Play. With Google Assistant and Google Chromecast, it also has the feature of parental control and allows you to create a favorite channel list. It comes with a base stand, wall mount bracket, and user s manual."},
{"name": "EcoStar 39 CX-39U573 LED TV", "link": "/price/ecostar-39-cx-39u573-led-tv", "price": "Rs. 37,999", "image_link": "/public/data/images/thumbs/588d8fcc60c8a9c4b1dad007c2d3a348.jpg", "description": "This 39-inch LED TV by EcoStar has many distinct and unique features that work together to make it a worthwhile purchase for its users. These features include a high-quality screen resolution of 1366 x 768 that provides the users with a cinematic experience from the comfort of their homes. Other than this, it has USB connectivity for audio, video as well as images. Along with these, it also has the feature of HDMI input. With a programmable sleep timer, this LED has 30 KGs of weight. To enhance customers , trust in the product, it also comes with a brand warranty."},
{"name": "TCL 32 S5200 Andorid LED TV", "link": "/price/tcl-32-s5200-andorid-led-tv", "price": "Rs. 37,500", "image_link": "/public/data/images/thumbs/ee64e5af1776b59952bf8497514c18e1.jpg", "description": "This 32 inches S2500 LED TV by TCL has all the features that work together to enhance the television watching experience of its users. It provides its users with a theatrical experience from the comfort of their homes. These features include HDR, Micro Dimming, and Dolby Audio which provides immersive 5.1 surround sound with the Dolby Decoder. Other than this, it has the option of voice search. T-cast is a feature exclusive to TCL which allows operating the television with the help of your smartphone. With Google Assistant, it comes with in-built applications that include Netflix, YouTube as well as in-built Bluetooth."},
{"name": "Ecostar CX-32U860", "link": "/price/ecostar-cx-32u860", "price": "Rs. 36,499", "image_link": "/public/data/images/thumbs/b3a3a0d0ebc9e56219a462c577e9d63c.jpg", "description": "EcoStar CX-32U860 is a new arrival in EcoStar's smart LED TVs. Its screen size is 32 inches and it comes equipped with HD ready resolution, USB and HDMI connectivity, and Netflix built-in app. The Dolby sound system gives a clear, loud, and perfect sound. Real Color Engine, DynaCon, Digital Comb Filter and Wide Color Enhancer ensure a powerful contrast with much deeper blacks and brighter whites, hence giving the best picture and video quality. This LED TV offers you easy direct access for Netflix and YouTube apps with a single click. With USB connectivity, you can display photo files from a digital camera. Moreover, you can easily project your PC or laptop screen to this LED TV. In short, it is an excellent affordable Smart LED TV on a budget."},
{"name": "EcoStar 32 CX-32U862 Android LED TV", "link": "/price/ecostar-32-cx-32u862-android-led-tv", "price": "Rs. 35,999", "image_link": "/public/data/images/thumbs/34d34c7969e61d034e00537edf9b689a.png", "description": "This 32-inch LED has many features that make it a cost-effective purchase for its users. These features include built-in Netflix, YouTube, Facebook Watch, and Twitter. With quad-core GPU, it also has USB connectivity of 2.0, HDMI and ARC of HDMI 1.4(HDCP 1.4), and EPG. It has an amazing screen and sound quality with real color engine, digital noise reduction, and Dolby sound. Along with all these, it has a wide color enhancer, Teletext as well as contrast enhancer. Other features include a built-in power cable, remote control, and wall mount bracket. To make things easier for the users, it comes with a user s manual."},
{"name": "EcoStar 40 Inch 40U561 LED TV", "link": "/price/ecostar-40-inch-40u561-led-tv", "price": "Rs. 35,900", "image_link": "/public/data/images/thumbs/1549308753355a1348525546ec7fd0be45af208b62.jpg", "description": "EcoStar is known for its budget-friendly electronics and the EcoStar 40U561 is no exception to this. The popular EcoStar 40U561 LED TV comes with a Full HD resolution, HDR capability, and USB and HDMI connectivity all in one package. The picture quality is excellent with great contrast, largely because of EcoStar's RealColor Engine that amplifies and fine-tunes the source. You can connect the EcoStar 40U561 with various input sources to stream your favorite content, but it does lack the smart TV features that we are now accustomed to. However, despite this, the EcoStar 40U561 is one of the most feature-rich and high-performing LED TVs that you will find in this price."},
{"name": "PEL 32 Smart HD LED TV", "link": "/price/pel-32-smart-hd-led-tv", "price": "Rs. 35,490", "image_link": "/public/data/images/thumbs/355aa5dbbac28fda218a441c3105521d.jpg", "description": "PEL ColorOn 32 is a Smart LED TV with HD resolution. It is a budget and pretty basic LED but of good quality. It's smart features lets you watch YouTube and Netflix in HD quality and has the HDMI connectivity to connect your devices to play anything on a bigger display."},
{"name": "Samsung 32 Inch 32N5000 LED TV", "link": "/price/samsung-32-inch-32n5000-led-tv", "price": "Rs. 35,489", "image_link": "/public/data/images/thumbs/6ef3f6f956ef81cdc9dc19ebc664f225.jpg", "description": "32N5000 is one of the flat, non-smart LED TVs from Samsung having a screen size of 32 inches. It comes equipped with Full HD resolution, HDMI, and USB connectivity. Full HD resolution provides crisp and clear images Wide Color Enhancer improves the image quality and displays bright and rich colors with more detail. You can plug and play your favorite entertainment on this LED TV. Enjoy videos, music, and view photos through a USB connection. Moreover, Clean View in 32N5000 LED TV reduces noise and interference and lets you enjoy everything with refined quality."},
{"name": "Hisense 32 Inch LED TV 32E5100F", "link": "/product/34843181/b27fcfc0d9c4c9b7b557b4bf759d6260?query=TEVEIFRW&position=19", "price": "Rs. 33,990", "image_link": "https://cdn.pakistanistores.com/data/ays/thumbs//d57fb5623bc977a8bea79616ef028a0b.jpg", "description": "HD Display (1,366 x 768 Resolution) Master Pro Engine Supports HDMI Motion Picture Enhancer Enhanced Color Imaging Crystal Clear Panel Real Surround Sound 2 Years Warranty"},
{"name": "EcoStar 32U579 32 HD Frameless LED TV", "link": "/product/34843148/a60e358034c900d0f708d17ac7bcea5b?query=TEVEIFRW&position=15", "price": "Rs. 29,900", "image_link": "https://cdn.pakistanistores.com/data/ays/thumbs//d63995ce3cfe926d9aaab47f6d11cedf.png", "description": "Dolby Digital HD Remote Control: Yes Power Cable (Built-In): Yes Batteries For Remote: Yes User Manual: Yes Wall Mount Bracket: Yes Base Stand: Yes"},
{"name": "HAIER HL32D2 32INCH STANDARD", "link": "/product/30100656/10ece62f20d4778b3b8e9ba6220908f4?query=TEVEIFRW&position=37", "price": "Rs. 39,999", "image_link": "https://cdn.pakistanistores.com/data/daredevil/thumbs//789c351074ba9c7131b011af7be8a12e.png", "description": "Latest of HAIER HL32D2 32INCH STANDARD in Pakistan is 39,999 PKR updated recently on August 2022. Basic specification is HD,  HDR (High Dynamic Range), 32,."},
{"name": "HAIER 32B9M 32INCH", "link": "/product/30312670/971124d7d31ce673e5866727eba727d1?query=TEVEIFRW&position=36", "price": "Rs. 39,900", "image_link": "https://cdn.pakistanistores.com/data/daredevil/thumbs//dbde80d502a242fbb50baecd0b43bbdb.png", "description": "Latest of HAIER 32B9M 32INCH in Pakistan is 39,900 PKR updated recently on August 2022. Basic specification is HD, 32,."},
{"name": "EcoStar 32 Inch CX-32U568 LED TV", "link": "/price/ecostar-32-inch-cx-32u568-led-tv", "price": "Rs. 34,054", "image_link": "/public/data/images/thumbs/2b427a1f0549bcbbdd2eae452d4ff028.png", "description": "EcoStar is famous for its budget-friendly electronics and another one of the newest, budget-friendly, 32-inch LED TVs from EcoStar is the EcoStar CX-32U568 which comes with HD resolution and USB & HDMI connectivity all in one package. Real Color Engine, Motion Reality engine, and A-Grade panel make the picture quality smooth and sharp. Sound quality is also quite good because of digital voice reduction. This LED TV also offers a USB connection so that you can listen to MP3 songs and watch HD videos. HDMI availability offers you to project your personal computer or laptop screen on this TV. Moreover, its screen size is quite impressive. This LED TV lacks smart features and Full-HD resolution but it is a very high performing LED TV to consider in this price range."},
{"name": "TCL 32 inch Smart LED TV 32S5200", "link": "/product/34843212/dc65a332a6ca85b440d1198cb25c47f2?query=TEVEIFRW&position=31", "price": "Rs. 38,990", "image_link": "https://cdn.pakistanistores.com/data/ays/thumbs//dfc5d3eaae5fc2427ad705833895da99.jpg", "description": "Google Android TV LED HD DTV Chassis RT41VT-AP CPU CA53*4 64bit GPU Mali470x2 OS Android O Certified by Google Android TV RAM/ROM 8G Byte eMMC Memory UI Style Google Android TV UI Power Consumption 50W Certification CB, Dolby Audio, CTS (Google official certification)"},
{"name": "Akira 32MG2023 LED TV", "link": "/price/akira-32mg2023-led-tv", "price": "Rs. 34,000", "image_link": "/public/data/images/thumbs/795dee2052652b35904ba7aba2474594.jpg", "description": "The MG2023 is another 32 LED TV by Akira. It has all the features of a budget LED such as HD display, HDMI connectivity to connect other devices and watching stuff. An average size, a beautiful design and built-in Sound bar also makes it a good catch."},
{"name": "EcoStar 32 Inch HD LED CX-32U871 A+", "link": "/product/34843139/e1251599cad5915f3eb10ddc83941b8a?query=TEVEIFRW&position=33", "price": "Rs. 39,500", "image_link": "https://cdn.pakistanistores.com/data/ays/thumbs//426a98cbec37bee40e109f007f0cf859.png", "description": "Built-in Netflix Screen Cast Dolby Sound Black Richness Streaming Applications Perfect Gaming Resolution One Button Access to Netflix & YouTube Core Graphic Processor"},
{"name": "EcoStar LED TV 32 Inch 32U870 A+", "link": "/product/34843216/4eab54487604a225fc5418fc6fe8424c?query=TEVEIFRW&position=34", "price": "Rs. 39,500", "image_link": "https://cdn.pakistanistores.com/data/ays/thumbs//70e66dd5aadb2f26ace9a117e80e7832.jpg", "description": "Screen Size: 32 inch LED HD TV Resolution: 1366 x 768 Power Consumption: 150W USB Ports: 2 HDMI Input: 2 HDMI & ARC Built in Google Play Store Android Smart LED TV Built-in Bluetooth Built-in Wi-Fi/LAN"},
{"name": "Orient 32 Blaze HD Black LED TV", "link": "/price/orient-32-blaze-hd-black-led-tv", "price": "Rs. 34,000", "image_link": "/public/data/images/thumbs/6b7f0a4567768db78e0c394effdb03be.jpg", "description": "This 32-Inch LED by Orient has many distinct features that make the purchase worthwhile. These features include a Full-screen display which boosts the screen resolution, a full-color optimizer that enables the users to see vivid and bright images on the screen as well as Dolby audio which enhances the sound quality. It has faster refresh rates as well as higher video resolutions all thanks to its feature of HDMI. The USB option enables the users to watch all the videos, images, and music they like. Along with this, it also has many different applications built-in."},
{"name": "EcoStar 32 Inch LED Sound Pro HD Frameless CX-32U578 A+", "link": "/product/34843217/0ceaca4e80d9d9850d8bdb292cbaeffb?query=TEVEIFRW&position=32", "price": "Rs. 39,500", "image_link": "https://cdn.pakistanistores.com/data/ays/thumbs//da08699cd37f7a2d3ae7bc905012033a.png", "description": "Image Refinery Nature View Motion Engine Plugin Your Entertainment"},
{"name": "Orient Trumpet 32S HD LED TV", "link": "/price/orient-trumpet-32s-hd-led-tv", "price": "Rs. 28,490", "image_link": "/public/data/images/thumbs/15559657479a05ea5225376cc7c09cefd8c9f217ac.jpg", "description": "An entry-level LED TV from Orient that features a 1080p streaming engine with an impressive 32-inch display that provides a smooth and comfortable viewing experience. Bundled with USB connectivity, HDMI connectivity, and Orient's own color enhancing technology, the Orient Trumpet 32S HD is a good choice to consider for a LED TV when you are on a budget."},
{"name": "EcoStar CX-32U573A+ Full HD LED TV 32 Inch", "link": "/product/34843134/5026aa8994c05cc12bb6cbee0aeeb08c?query=TEVEIFRW&position=13", "price": "Rs. 28,500", "image_link": "https://cdn.pakistanistores.com/data/ays/thumbs//2c316eacba266ddc7e51711070457404.png", "description": "Screen Size: 32  LED TV Resolution: 1366 x 768 (HD Ready) Power Consumption: 55W USB Connectivity HDMI Input: 2 Auto Power Off PC-Input Motion Engine Image Refinery Nature View Frameless Design DynaCon"},
{"name": "TCL Standard LED TV 32 Inches 32D310", "link": "/product/34843132/7d85823f6ee583c9dce4ba9a66cf018c?query=TEVEIFRW&position=12", "price": "Rs. 28,500", "image_link": "https://cdn.pakistanistores.com/data/ays/thumbs//98a34fbcacef294dca015b050b901180.jpg", "description": "32 Inches Standard LED HD Resolution Natural Light Engine Turbo Sound 1 USB/2 HDMI Inputs 1 Year Warranty"}
]