[
{"name": "PEL 32 Inch HD LED TV", "link": "/price/pel-32-inch-hd-led-tv", "price": "Rs. 23,999", "image_link": "/public/data/images/thumbs/15493122403c79c984602a0dc97510ce4f84e11fa5.jpg", "description": "The PEL 32 HD also known as the PEL Coloron 32 is a budget LED TV that covers all the basics of LED TVs. With HDMI connectivity and USB connectivity, you can stream content from various sources on this PEL 32 HD LED TV. The picture quality is decent and the overall design is simple and clean as well. There is nothing much else to speak about with the PEL 32 HD, but if you are looking for a basic LED TV for watching and playing HD movies and games then the PEL Coloron 32 is a good choice."},
{"name": "EcoStar 32 CX-32U573 LED TV", "link": "/price/ecostar-32-cx-32u573-led-tv", "price": "Rs. 26,899", "image_link": "/public/data/images/thumbs/0ff1e529bc6b9225b9a64d600bbb156a.jpg", "description": "This 32-inch LED by EcoStar has many features that work together to make it a cost-effective purchase. These features include 1366 x 768 of screen resolution, USB connectivity for audio, video and images, HDMI x2 and programmable sleep timer. Along with these, motion processing, image refinery as well as program memory of 199 channels and surround sound. With wide view angle and digital noise reduction, it provides it viewers with cinematic experience from the comfort of their homes. Moreover, it has power supply of AC 100-200 V. This LED comes with a 2-year warranty which enhances its reliability."},
{"name": "Orient Leopard 32 Inch LED TV", "link": "/price/orient-leopard-32-inch-led-tv", "price": "Rs. 27,000", "image_link": "/public/data/images/thumbs/9e7f6186b3e32b1efbb4f60634669c96.jpg", "description": "Orient Leopard 32 Inch LED TV is an economical purchase that provides its users with a wide range of features that enhance their experience. It provides vivid and sharp images owing to its resolution i.e. 720p (1366x768). Along with this, it also has 12W powered Dolby speakers that amplifies the audio quality. It can work on power as low as 50W and is therefore energy efficient. This model has an ultra thin profile that gives it a sleek and modern look. It also comes with a 1-year official warranty."},
{"name": "EcoStar 32 Inch 32U571 LED TV", "link": "/price/ecostar-32-inch-32u571-led-tv", "price": "Rs. 27,000", "image_link": "/public/data/images/thumbs/15492060143e6a5a507dc420622ffc6e9b00a69c9d.jpg", "description": "EcoStar is a reputed name in the electronics industry in Pakistan, particularly because of its budget-friendly LED TVs. The EcoStar 32U571 is a budget LED TV that comes with HD resolution, HDR, and USB connectivity to provide you with an all-in-one package. The Sound Max Engine coupled with the RealColor Engine ensure that the picture quality is crisp, clear, and sharp with life-like audio playback. Overall, the picture quality is impressive and this is a worthy choice if you are looking for an affordable LED TV for your home or office. There is no FHD resolution on board, but there is only so much that you can ask from this price range."},
{"name": "Akira 24MG102 LED TV", "link": "/price/akira-24mg102-led-tv", "price": "Rs. 19,999", "image_link": "/public/data/images/thumbs/8399c5af0a85d96e4a0a0d89bbc8753c.jpg", "description": "The Akira 24 MG102 is a budget LED TV. It has HD resolution for clear display, HDMI connectivity to connect your other devices. It has stereo sound and a beautiful look."},
{"name": "Orient Macaw 32 Inch LED TV", "link": "/price/orient-macaw-32-inch-led-tv", "price": "Rs. 23,100", "image_link": "/public/data/images/thumbs/ad099edf3eb7c4fbab94b0c93841cff4.jpg", "description": "Orient Macaw 32 Inch LED TV comes with a wide variety of features that help provide its users with theatrical experience from the comfort of their homes. These features include black bezel/stand, effective refresh rate of 50 Hz, 720p HD resolution along with connectivity facilities such as USB ports and HDMI ports. This 32-Inch LED comes with a user-friendly manual and claim of durability that is backed up by a 1-year official warranty."},
{"name": "EcoStar 32 CX-32U575 LED TV", "link": "/price/ecostar-32-cx-32u575-led-tv", "price": "Rs. 28,300", "image_link": "/public/data/images/thumbs/55fb2e8313165e34ed5063d5839fd2a4.jpg", "description": "This LED by EcoStar has many unique and distinct features that together make it a worthwhile purchase for its consumers. These features include a resolution of 1366 x 768, USB connectivity for audio, video & images, 2 HDMI input ports, PC- input for audio and video, motion processing, and an A-grade panel. Apart from these, it also has a program memory of 199 channels and power consumption of 55W. The optimum operating temperature for the LED is 5 C ~ 40 C and the humidity level is 10% ~ 85%. Along with all these features, to make it more reliable for its users, it has a 1-year manufacturer warranty."},
{"name": "TCL 32 Inch Led Tv D310", "link": "/price/tcl-32-inch-led-tv-d310", "price": "Rs. 27,900", "image_link": "/public/data/images/thumbs/4538c03ac4db9673b7c4b066dec4aa13.jpg", "description": "D310 is a basic, non-smart, entry-level LED TV from TCL which comes with features of HD resolution, 32 inches display, and USB & HDMI connections. Natural Light Engine in this LED TV provides the brightest and highest contrast level to ensure true color reproduction. Turbo Sound enhances your entertainment experience and the USB & HDMI connections allow you to share your favorite data from different technologies and systems and display on your TV. Although it is not a smart TV, it is a good choice for the people who are on a budget."},
{"name": "EcoStar 32 CX-32U576 LED TV", "link": "/price/ecostar-32-cx-32u576-led-tv", "price": "Rs. 25,999", "image_link": "/public/data/images/thumbs/5712df8dd932b9b1ba778a9db6f2b761.jpg", "description": "This 32-inch LED by EcoStar has many features and specifications that make it a worthwhile purchase for its users. These features and specifications include a built-in power cable, power consumption of 55 W, and surround sound. Along with these, it also has energy-saving features, a base stand, a user s manual as well as batteries for the remote. This one has a frameless screen which provides its users with a more magnified and better television viewing experience. With its high audio and video quality, it provides a cinematic experience to its viewers from the comfort of their homes. Its weight is 40 Kgs and comes with a brand warranty."},
{"name": "EcoStar 32 Inch 32U563 LED TV", "link": "/price/ecostar-32-inch-32u563-led-tv", "price": "Rs. 24,000", "image_link": "/public/data/images/thumbs/15493090303e434059a3f7472a957b72f632a991a7.png", "description": "The EcoStar 32U563 is a budget LED TV that comes with the entry-level features that EcoStar has to offer. With a sizeable 32-inch HD screen, the Sound Max Engine, and the RealColor Engine, the LED TV can deliver a good picture quality, particularly for this price range. The sound is clear and natural whereas the colors are accurate but a little dull. Overall, if you are looking for a budget LED TV with an impressive screen size then the EcoStar 32U563 LED TV is a good choice for you to consider."},
{"name": "Haier 32B9200M LED TV", "link": "/price/haier-32b9200m-led-tv", "price": "Rs. 31,275", "image_link": "/public/data/images/thumbs/15559640113e27f73c887dd2b7ab9d119402c4abc4.jpg", "description": "This is another, affordable option from Haier LED TV series with smart share capabilities. This smart TV delivers sharp and bright picture quality with its HD Ready technology and Miracast screen mirroring. With Auto volume leveler, the sound is streamlined so that all volume fluctuations during change of programs or television channels are eradicated. This television is also aesthetically pleasing and will make a nice addition to your living spaces."},
{"name": "EcoStar 39 Inch 39U563 LED TV", "link": "/price/ecostar-39-inch-39u563-led-tv", "price": "Rs. 31,000", "image_link": "/public/data/images/thumbs/1549308822bd6211976ec1324bc00e7a1ca8d31c87.jpg", "description": "The EcoStar 39U563, like its counterpart the EcoStar 39U564, is a budget LED TV from one of the leading electronics brands in Pakistan. The EcoStar 39U563 is a non-smart flat LED TV that is equipped with a vibrant 39-inch display, EcoStar's own Motion Reality and RealColor engines, and a Sound Max engine for boosting the sound performance. The picture quality of the EcoStar 39U563 is quite impressive with good contrast and excellent color reproduction. The only lacking is the FHD resolution, which should be a standard for all LED TVs in this price. Other than the resolution, the overall specifications and performance of the EcoStar 39U563 LED TV is on par with other LED TVs in this price range."},
{"name": "EcoStar 39 Inch 39U564 LED TV", "link": "/price/ecostar-39-inch-39u564-led-tv", "price": "Rs. 29,999", "image_link": "/public/data/images/thumbs/1549308874dc30341abbaacc07af8c792ae295cecd.png", "description": "The EcoStar 39U564 LED TV is a flat non-smart basic LED TV that covers all the essentials in one package. Whether you are looking forward to watching your favorite shows on cable or looking to stream content directly from your smartphone, the EcoStar 39U564 will have you covered. The Motion Reality Engine provides a smooth and lag-free experience whereas the RealColor Engine delivers great contrast and excellent color reproduction. It is not the best in terms of resolution or sharpness, but the overall performance and rich features of the EcoStar 39U564 make it one of the most reliable budget LED TVs out there."},
{"name": "Samsung 32 Inch 32K4000 LED TV", "link": "/price/samsung-32-inch-32k4000-led-tv", "price": "Rs. 29,550", "image_link": "/public/data/images/thumbs/36e2c251c70526c44919339bcf347144.jpeg", "description": "Enjoy Dynamic visuals, bright colors and vivid details with Samsung 32 inch HD Flat LED TV 32K4000. Its noise-reducing and Color & Contrast enhancing technology make you feel that you are in the middle of the action.. Bluetooth connection allows you to connect it with your phone and play your favorite playlist. You can display your favorite photos from your digital camera via USB connectivity. Samsung's Wide Color Enhancer technology displays the images as they were intended to be seen. This LED TV comes with different stylish looks. It has metallic legs that fit in the built-in holes, hence, making it perfect for bedtime. It doesn't have messy wires and has a unique, clean, and stylish design. 32K4000 lacks smart features but it is a good choice for the people who are on a budget."},
{"name": "Akira 39MG4013 LED TV", "link": "/price/akira-39mg4013-led-tv", "price": "Rs. 40,300", "image_link": "/public/data/images/thumbs/da5d1b2404f76d1923d73749534093d5.jpg", "description": "Akira's 39 MG4013 is a large and pretty LED TV. It has HD resolution for great display quality. Although it doesn't have smart features, It does have all the ports like HDMI and USB to connect your other devices and watch things on a larger screen. It's great sound system and beautiful look also contributes in providing a great overall experience."},
{"name": "Hisense 32 Inch LED TV 32E5100F", "link": "/product/34843181/b27fcfc0d9c4c9b7b557b4bf759d6260?query=TEVEIFRW&position=6", "price": "Rs. 25,999", "image_link": "https://cdn.pakistanistores.com/data/ays/thumbs//d57fb5623bc977a8bea79616ef028a0b.jpg", "description": "HD Display (1,366 x 768 Resolution) Master Pro Engine Supports HDMI Motion Picture Enhancer Enhanced Color Imaging Crystal Clear Panel Real Surround Sound 2 Years Warranty"},
{"name": "TCL 32 A3 LED TV", "link": "/price/tcl-32-a3-led-tv", "price": "Rs. 39,999", "image_link": "/public/data/images/thumbs/43fc0d79b662a6c84795c68d124db399.jpg", "description": "TCL 32 A3 is a smart Android powered Smart TV capable of smart features. It packs a 32-Inch HD screen with a resolution of 1366 x 768 pixels. Although the display is HD, the best part of the TV is the Android OS which lets you explore a whole lot of viewing options including Netflix and YouTube. The HDR 10 on this device optimizes the colors of scenes to enhance your viewing experience."},
{"name": "Samsung 40 Inch 40N5300 LED TV", "link": "/price/samsung-40-inch-40n5300-led-tv", "price": "Rs. 39,870", "image_link": "/public/data/images/thumbs/a92045101c27493783314289d20bd862.jpg", "description": "Experience the best innovation with the Samsung 40N5300 LED TV. This Samsung LED TV comes equipped with a 40-inch display, Full HD resolution, 2 HDMI Ports, and 1 USB port. The large FHD screen provides a crisp and clear image with brilliant details. Micro Dimming Pro enhances the sharpness and depth of the color. HDR technology in this LED enhances the clarity and Ultra Clean View reduces the distortion. HyperReal Engine optimizes the picture for a perfect visual experience and Pure Color technology makes you feel that you are in the middle of the action. Enjoy the superb sound with 40N5300 because of Dolby Digital Plus audio technology. Samsung Cloud feature helps to sync your phone's gallery to the TV while the Ethernet port provides an easy, stable, and high-speed connection to the internet. Furthermore, this LED TV is designed to add beauty to your interior."},
{"name": "Ecostar CX-32U870 32 Android LED TV", "link": "/price/ecostar-cx-32u870-32-android-led-tv", "price": "Rs. 38,150", "image_link": "/public/data/images/thumbs/35a33a3b69c5085d06cedf944df908be.png", "description": "This android LED TV comes with many different features and specifications. These features and specifications include frameless design, screen resolution of 1366 x 768, Mali 450 quad-core, android 9.0, built-in Wi-Fi, and LAN. Along with these features, it has 1 GB RAM and 8 GB ROM. Moreover, it has built-in apps with Google Play along with preinstalled ones that include Netflix, YouTube, Prime Video, and Google Play. With Google Assistant and Google Chromecast, it also has the feature of parental control and allows you to create a favorite channel list. It comes with a base stand, wall mount bracket, and user s manual."},
{"name": "EcoStar 39 CX-39U573 LED TV", "link": "/price/ecostar-39-cx-39u573-led-tv", "price": "Rs. 37,999", "image_link": "/public/data/images/thumbs/588d8fcc60c8a9c4b1dad007c2d3a348.jpg", "description": "This 39-inch LED TV by EcoStar has many distinct and unique features that work together to make it a worthwhile purchase for its users. These features include a high-quality screen resolution of 1366 x 768 that provides the users with a cinematic experience from the comfort of their homes. Other than this, it has USB connectivity for audio, video as well as images. Along with these, it also has the feature of HDMI input. With a programmable sleep timer, this LED has 30 KGs of weight. To enhance customers , trust in the product, it also comes with a brand warranty."},
{"name": "EcoStar LED TV 32 Inch 32U870 A+", "link": "/product/34843216/4eab54487604a225fc5418fc6fe8424c?query=TEVEIFRW&position=40", "price": "Rs. 40,800", "image_link": "https://cdn.pakistanistores.com/data/ays/thumbs//70e66dd5aadb2f26ace9a117e80e7832.jpg", "description": "Screen Size: 32 inch LED HD TV Resolution: 1366 x 768 Power Consumption: 150W USB Ports: 2 HDMI Input: 2 HDMI & ARC Built in Google Play Store Android Smart LED TV Built-in Bluetooth Built-in Wi-Fi/LAN"},
{"name": "EcoStar 32U579 32 HD Frameless LED TV", "link": "/product/34843148/a60e358034c900d0f708d17ac7bcea5b?query=TEVEIFRW&position=18", "price": "Rs. 30,500", "image_link": "https://cdn.pakistanistores.com/data/ays/thumbs//d63995ce3cfe926d9aaab47f6d11cedf.png", "description": "Dolby Digital HD Remote Control: Yes Power Cable (Built-In): Yes Batteries For Remote: Yes User Manual: Yes Wall Mount Bracket: Yes Base Stand: Yes"},
{"name": "TCL 32 S5200 Andorid LED TV", "link": "/price/tcl-32-s5200-andorid-led-tv", "price": "Rs. 37,500", "image_link": "/public/data/images/thumbs/ee64e5af1776b59952bf8497514c18e1.jpg", "description": "This 32 inches S2500 LED TV by TCL has all the features that work together to enhance the television watching experience of its users. It provides its users with a theatrical experience from the comfort of their homes. These features include HDR, Micro Dimming, and Dolby Audio which provides immersive 5.1 surround sound with the Dolby Decoder. Other than this, it has the option of voice search. T-cast is a feature exclusive to TCL which allows operating the television with the help of your smartphone. With Google Assistant, it comes with in-built applications that include Netflix, YouTube as well as in-built Bluetooth."},
{"name": "Ecostar CX-32U860", "link": "/price/ecostar-cx-32u860", "price": "Rs. 36,499", "image_link": "/public/data/images/thumbs/b3a3a0d0ebc9e56219a462c577e9d63c.jpg", "description": "EcoStar CX-32U860 is a new arrival in EcoStar's smart LED TVs. Its screen size is 32 inches and it comes equipped with HD ready resolution, USB and HDMI connectivity, and Netflix built-in app. The Dolby sound system gives a clear, loud, and perfect sound. Real Color Engine, DynaCon, Digital Comb Filter and Wide Color Enhancer ensure a powerful contrast with much deeper blacks and brighter whites, hence giving the best picture and video quality. This LED TV offers you easy direct access for Netflix and YouTube apps with a single click. With USB connectivity, you can display photo files from a digital camera. Moreover, you can easily project your PC or laptop screen to this LED TV. In short, it is an excellent affordable Smart LED TV on a budget."},
{"name": "EcoStar 32 Inch LED Sound Pro HD Frameless CX-32U578 A+", "link": "/product/34843217/0ceaca4e80d9d9850d8bdb292cbaeffb?query=TEVEIFRW&position=39", "price": "Rs. 40,400", "image_link": "https://cdn.pakistanistores.com/data/ays/thumbs//da08699cd37f7a2d3ae7bc905012033a.png", "description": "Image Refinery Nature View Motion Engine Plugin Your Entertainment"},
{"name": "TCL 32 inch Smart LED TV 32S5200", "link": "/product/34843212/dc65a332a6ca85b440d1198cb25c47f2?query=TEVEIFRW&position=33", "price": "Rs. 38,990", "image_link": "https://cdn.pakistanistores.com/data/ays/thumbs//dfc5d3eaae5fc2427ad705833895da99.jpg", "description": "Google Android TV LED HD DTV Chassis RT41VT-AP CPU CA53*4 64bit GPU Mali470x2 OS Android O Certified by Google Android TV RAM/ROM 8G Byte eMMC Memory UI Style Google Android TV UI Power Consumption 50W Certification CB, Dolby Audio, CTS (Google official certification)"},
{"name": "Hisense 32 inch Smart LED TV 32E5600F", "link": "/product/34843235/a32d5ad486a634e190079fbd1989fdf5?query=TEVEIFRW&position=32", "price": "Rs. 38,600", "image_link": "https://cdn.pakistanistores.com/data/ays/thumbs//75bb1a4fb16d0b6914c8b55b75535570.jpg", "description": "Bezeless Design Voice Control HD Ready Bluetooth Ram/Rom 1GB/8GB Dbx TV Chrome cast Built-In Bluetooth Full HD 1920 x 1080 Crystal clear panel Wide view angle Auto power off (no signal)"},
{"name": "Orient Thriller 43 Inch LED TV", "link": "/price/orient-thriller-43-inch-led-tv", "price": "Rs. 62,010", "image_link": "/public/data/images/thumbs/2f4c897be06a867fa1df1373075b445e.jpg", "description": "Orient Thriller 43 Inch LED TV includes a wide range of features that add value to this purchase. The key features of this LED TV include 43S FHD Wide screen, android 8.0, 8 GB storage memory, effective refresh rate of 50 Hz, updateable software, FHD high definition resolution along with high quality audio powered by Dolby. It also has various connectivity options such as headphone jack, HDMI ports as well as USB port. This 43-Inch model comes with a 1-year official warranty."},
{"name": "Sony 85 Inch UHD Smart LED TV KD-85X85J", "link": "/product/34843771/596eb5e4a4dc6dc2d748f59c99988694?query=TEVEIFRW&position=241", "price": "Rs. 8,95,300", "image_link": "https://cdn.pakistanistores.com/data/ays/thumbs//3461a33bd8a6220bdca4030c0c311494.jpg", "description": "Over a billion colours TRILUMINOS PRO  4K HDR Processor X1 . Extreme contrast Everything you watch feels so real Clear multidimensional sound"},
{"name": "EcoStar CX - 43UD951A 4K UHD Smart LED TV", "link": "/price/ecostar-cx-43ud951a-4k-uhd-smart-led-tv", "price": "Rs. 56,900", "image_link": "/public/data/images/thumbs/1036312a79453515ee84a8dc8513d977.jpg", "description": "EcoStar CX - 43UD951A is Smart LED TV with Built-in Youtube and Netflix connectivity that lets you explore the world of entertainment. Its 4K Ultral HD Display gives a vivid viewing experience which is enhanced by its deep black richness seamless picture quality. The HDR feature adds a realistic touch to the image. With easy multimedia sharing, it lets you view your memorable pictures on the big screen by casting it from your smartphone. Its built-in Dolby Sound System produces perfect quality sound and it has best screen resolution for gaming visuals."},
{"name": "TCL 55C815 LED TV", "link": "/price/tcl-55c815-led-tv", "price": "Rs. 1,59,500", "image_link": "/public/data/images/thumbs/d093b9c70afb562248d0109ba317646d.jpg", "description": "TCL offers another 4K UHD LED TV, the 55C815 that comes with a screen size of 55 inches. This TV features Quantum Dot display, 4K resolution, voice control, HDR 10+, Dolby Atmos, IPQ, Google Assistant, Chromecast built-in, MEMC, YouTube, integrated Onkyo soundbar, Micro Dimming, the latest Android OS, Bluetooth built-in, and Netflix. With Youtube & Netflix built-in, you can watch the popular entertainment programs in 4K. Bluetooth built-in lets you connect your devices (mobile, headphones, and others) with the TV. Dolby Atmos ensures the perfect and crisp sound quality. Motion Enhancement and Motion Control ( MEMC) provides a smoother viewing experience in fast-moving and action-packed content. With Onkyo Soundbar Subwoofers, you will enjoy a cinematic sound experience. HDR 10+ optimizes pictures and provides richer and more immersive entertainment than ever. With all of these innovative features, 55C815 LED TV is one of the best options to consider while buying a smart LED TV."},
{"name": "Sony 65 Inch 65X8000G LED TV", "link": "/price/sony-65-inch-65x8000g-led-tv", "price": "Rs. 2,35,999", "image_link": "/public/data/images/thumbs/44955ccb6e98bc02d724ca9eb1c54e06.jpg", "description": "65X8000G LED TV is one of the best Smart LED TVs from Sony, a renowned brand in electronics. It comes equipped with 4K HDR resolution to provide a sharpened and refined display. Triluminos Display adds extra colors and extra brilliance, faithfully reproducing every shade of the picture. You can hear music and dialogue with greater clarity because of its amazing sound system. Voice search in this LED TV allows you to find content without the hassle of time-consuming text entry. With advanced voice control, you can easily enjoy your favorite shows in an instant. Sony BRAVIA is Chromecast built-in so you can easily cast YouTube or Netflix on your TV. Moreover, it has a beautiful, sleek, and stylish design. In short, 65X8000G LED TV is the best choice for a person who is looking for all of these awesome features."},
{"name": "Samsung 65 Inch 65TU7000 LED TV", "link": "/price/samsung-65-inch-65tu7000-led-tv", "price": "Rs. 1,79,999", "image_link": "/public/data/images/thumbs/bfe14c838bbbb26f12ff1a58104457b6.png", "description": "Enjoy a crisp, clear, and lifelike viewing experience with your 65TU7000 UHD LED TV. This Smart LED TV comes equipped with the features of Crystal Display, HDR, 4K UHD resolution, Auto Game Mode, One Remote, Amazon Alexa, AirPlay 2, Google Assistant, and Clean Cable Solution. Its sleek minimalistic, boundless design draws you into the screen from every angle. HDR, 4K resolution, and Crystal Display make the picture quality superb. With Google Assistant, you can now control your LED TV with your voice. Play music, adjust the volume, change channels only by asking. AirPlay 2 built-in lets you stream and share content from your Apple device to your TV so you will enjoy your favorite content effortlessly on the big screen of your Samsung LED TV. Moreover, the Clean Cable solution keeps all your cables clean and tidy and hides them in a stand."},
{"name": "HAIER 32B9M 32INCH", "link": "/product/30312670/971124d7d31ce673e5866727eba727d1?query=TEVEIFRW&position=35", "price": "Rs. 39,900", "image_link": "https://cdn.pakistanistores.com/data/daredevil/thumbs//dbde80d502a242fbb50baecd0b43bbdb.png", "description": "Latest of HAIER 32B9M 32INCH in Pakistan is 39,900 PKR updated recently on August 2022. Basic specification is HD, 32,."},
{"name": "EcoStar 43 Inch FHD LED TV CX-43U871 A+", "link": "/product/34843340/10dca323a8abe07ee93764d58c233e1c?query=TEVEIFRW&position=78", "price": "Rs. 60,100", "image_link": "https://cdn.pakistanistores.com/data/ays/thumbs//a80704ec751d2fbf148d1dde710a2bc5.png", "description": "Latest Android 11 Enjoy the world of IoT with Google Assistant Unlimited Applications Flawless Connectivity Bluetooth 5.0 Built   in Chrome Cast Advanced Hybrid Log Gamma"},
{"name": "TCL Android Smart LED 43 Inch L43S65A", "link": "/product/34843350/95ba60ada728d8cf1d60e0c16a0e2df8?query=TEVEIFRW&position=77", "price": "Rs. 59,990", "image_link": "https://cdn.pakistanistores.com/data/ays/thumbs//5b0d173ea83f2ad98e0198fb962cfa8c.jpg", "description": "Slim Design FULLSCREEN HDR Micro Dimming IPQ Engine Wide Viewing Angle Dolby Audio Smart Volume DTS Deconding Technology Voice Search Chromecast Built-in Google Play Movies & TV"},
{"name": "HAIER HL32D2 32INCH STANDARD", "link": "/product/30100656/10ece62f20d4778b3b8e9ba6220908f4?query=TEVEIFRW&position=37", "price": "Rs. 39,999", "image_link": "https://cdn.pakistanistores.com/data/daredevil/thumbs//789c351074ba9c7131b011af7be8a12e.png", "description": "Latest of HAIER HL32D2 32INCH STANDARD in Pakistan is 39,999 PKR updated recently on August 2022. Basic specification is HD,  HDR (High Dynamic Range), 32,."},
{"name": "Sony 55 Inch 55X9500H LED TV", "link": "/price/sony-55-inch-55x9500h-led-tv", "price": "Rs. 2,35,999", "image_link": "/public/data/images/thumbs/41c4c5cbdc701a62d9c725caf2dcf36d.jpg", "description": "This 4K Ultra HD LED by Sony has many features that add to its value and make it an amazing purchase. These features include an impeccable UHD HDR10 Display, X-wide angle, and X-motion clarity along with Acoustic Multi-Audio and X-balanced Speaker that enhances its sound quality. Apart from this, it has a premium blade stand and thin bezel which helps its users stay focused on the image. With bright, vivid & vibrant images and perfect sound, it boosts the television watching experience of its users making it a cost-effective purchase. Furthermore, it comes with a 1-year-warranty."},
{"name": "HAIER LE43B9200 43 INCH STANDARD", "link": "/product/30102704/74ea18b879469586fe2e5388aad3a315?query=TEVEIFRW&position=58", "price": "Rs. 49,999", "image_link": "https://cdn.pakistanistores.com/data/daredevil/thumbs//d5532afce61a39a0483ed8c95061b71c.png", "description": "Latest of HAIER LE43B9200 43 INCH STANDARD in Pakistan is 49,999 PKR updated recently on August 2022. Basic specification is 4K UHD,  HDR (High Dynamic Range),  Smart TV (Youtube, Internet Browsing e.t.c), 43,."},
{"name": "MULTY NET NX7 43INCH SMART LED", "link": "/product/31746948/fdc7b53e85fa6bbe2a30b713b39f6f4b?query=TEVEIFRW&position=79", "price": "Rs. 61,990", "image_link": "https://cdn.pakistanistores.com/data/daredevil/thumbs//a9a6775fef3c71a7956afc9648bd37a3.png", "description": "Latest of MULTY NET NX7 43INCH SMART LED in Pakistan is 61,990 PKR updated recently on August 2022. Basic specification is FHD,  HDR (High Dynamic Range),  Smart TV (Youtube, Internet Browsing e.t.c), 43?,."},
{"name": "TCL 43 Inch Smart LED TV 43S5200", "link": "/product/34843339/447a6b2b4faabb328cd7ea71013038a4?query=TEVEIFRW&position=72", "price": "Rs. 58,890", "image_link": "https://cdn.pakistanistores.com/data/ays/thumbs//2bfc0e7cecc8f6dfa59f906cef7ebc82.png", "description": "Resolution 1920*1080 UHD Support HDR 2K HDR10 Decoding High Color Gamut Micro Dimming Contrast Ratio 4000:1 Response Time (G to G) 6.5ms Colors 16.7 Million(8bit) Refresh Rate 60Hz Dynamic Contrast Backlight Adjustable Yes (0~100) Wi-Fi and LAN HDMI 2 SPDIF USB 1 * 2.0 A/V IN Yes Headphone"},
{"name": "Sony 65 Inch 65X8000H LED TV", "link": "/price/sony-65-inch-65x8000h-led-tv", "price": "Rs. 2,29,999", "image_link": "/public/data/images/thumbs/a5ae581d95fcb26a8a8e310856f51af2.jpg", "description": "Manufactured in a sophisticated and elegant design and a classy shade of black, this 65  LED TV by Sony can enhance the grace of any room or space. It has many distinct features that make it stand out. These features include 4K UHD TV resolution, 4 HDMI input sources, and the Android operating system. Thanks to its powerful processor, it is able to get rid of extra noise and provide its users with clear, bright and vivid images with high sound quality. another feature that helps to set this product apart from others is TRILUMINOS Display which is powered by an X1 processor that further defines the image quality."},
{"name": "TCL 40 INCH S65A 2K Smart LED TV", "link": "/product/32534979/604b2617e768a227c26601b89cd4853b?query=TEVEIFRW&position=75", "price": "Rs. 58,990", "image_link": "https://cdn.pakistanistores.com/data/daredevil/thumbs//cf8ac3fb74b3fa5566cc02c76ccc149f.png", "description": "Latest of TCL 40 INCH S65A 2K  Smart LED TV in Pakistan is 58,990 PKR updated recently on August 2022. Basic specification is 2K,  HDR (High Dynamic Range),  Smart TV (Youtube, Internet Browsing e.t.c), 40 Inch,."},
{"name": "Sony 65 Inch 65X7500H LED TV", "link": "/price/sony-65-inch-65x7500h-led-tv", "price": "Rs. 2,29,999", "image_link": "/public/data/images/thumbs/9ecd4ab8a869dd7d5044c86169517835.jpg", "description": "This 65  LED by Sony is manufactured in a sophisticated shade of black. It has many distinct features that make it worth its price. These features include acoustic multi-audio which means that it has 4 speakers that together enhance the sound quality. Apart from this, it also has live color technology and TRILUMINOS display resulting in bright, vibrant, and vivid images on its screen. which has a resolution of 3840 x 2160. Thanks to these features, the users' experience are enhanced tenfold and it provides them with a cinematic experience from the comfort of their homes. Other features include voice search, motion flow XR 800, 4K X-Reality PRO, Auto mode object-based HDR remaster, and the dynamic contrast enhancer."},
{"name": "ECOSTAR CX-40U870A 40inch SMART LED TV", "link": "/product/30969440/db6fb97dab122aed5d26b487ff22e5e9?query=TEVEIFRW&position=76", "price": "Rs. 59,499", "image_link": "https://cdn.pakistanistores.com/data/daredevil/thumbs//764d7c08ebc3e6a5e61c9dc49cb6a713.png", "description": "Latest of ECOSTAR CX-40U870A 40inch SMART LED TV in Pakistan is 59,499 PKR updated recently on August 2022. Basic specification is HD, 40,."},
{"name": "Samsung 65 Inch 65TU8500 LED TV", "link": "/price/samsung-65-inch-65tu8500-led-tv", "price": "Rs. 2,27,900", "image_link": "/public/data/images/thumbs/06ec94533ec2f6ee0ba7c683abb81a90.jpg", "description": "One of the UHD LED TVs from no 1 TV brand Samsung is 65TU8500. This LED TV features 65 inches screen, Dual LED, Dynamic Crystal Display, 3-side boundless design, Crystal Processor 4K, HDR, Ambient mode, Game Enhancer, Multi View, Tap View, Multiple Voice Assistants, Amazon Alexa, Google Assistant, and AirPlay 2. With AirPlay 2 built-in, you can enjoy videos, music, or photos from your iPad, iPhone, and Mac on the big screen of your Samsung LED TV. Enjoy a hands-free experience with Google Assistant and control your TV with your voice. With Multiple Voice Assistants, everything is much easier. So you can enjoy your favorite content just by telling your LED TV what you want. Multi View lets you enjoy multiple contents at the same time while Tap View allows you to mirror your mobile screen on your TV effortlessly."},
{"name": "TCL 65C815 LED TV", "link": "/price/tcl-65c815-led-tv", "price": "Rs. 2,25,300", "image_link": "/public/data/images/thumbs/4c51e60bd546c02d2426d380d98765e2.jpg", "description": "65C815 LED TV is another 4K LED TV from TCL. The main features of this TV are Dolby Vision, hands-free voice control, 4K resolution, Quantum Dot technology, HDR 10+, IPQ, Bluetooth, Dolby Atmos, Google Assistant, Chromecast built-in, Google Play Store, MEMC, and YouTube. MEMC makes pictures smoother so you will see fast-moving and action-packed content with every detail. micro dimming analyzes the content in hundreds of separate zones and adjusts the brightness so you will experience a great contrast even in dark. Moreover, Dolby Atmos improves sound quality while Magiconnect allows you to control your TV from your smartphone. You will now enjoy Netflix and YouTube in 4K UHD resolution on your own TCL LED TV. With Google Assistant, you can ask questions and tell it to do things for you. It helps with over 1 million functions. Bluetooth built-in provides you a hands-free TV experience. All the more, the Onkyo soundbar subwoofers ensure that you will get a cinematic sound experience."},
{"name": "TCL S65 40inches SMART LED TV", "link": "/product/31521874/8b00170a47b7b2a8b1856479fd6164b2?query=TEVEIFRW&position=73", "price": "Rs. 58,989", "image_link": "https://cdn.pakistanistores.com/data/daredevil/thumbs//7a94cd3ffed16f9391959dabb88b8fc0.png", "description": "Latest of TCL S65 40inches SMART LED TV in Pakistan is 58,989 PKR updated recently on August 2022. Basic specification is 2K,  HDR (High Dynamic Range),  Smart TV (Youtube, Internet Browsing e.t.c), 40,."},
{"name": "EcoStar CX - 75UD931A 4K UHD Smart LED TV", "link": "/price/ecostar-cx-75ud931a-4k-uhd-smart-led-tv", "price": "Rs. 2,22,000", "image_link": "/public/data/images/thumbs/f39973c443facadb6cb15c22049308ea.jpg", "description": "EcoStar CX - 75UD931A is a Smart LED TV that has a built-in Licensed connectivity for Netflix and YouTube and various other streaming application that lets you dive into the world of entertainment and watch all the latest TV shows. With its Open Browser, it can replace your PC as your browsing partner. It has a 4K Ultra HD Display with a screen resolution of 3840 x 2160 that adds richness, sharpness and clarity to the images. It has a powerful contrast with deeper blacks and brighter whites and gives a realistic image experience through HDR. Its built-in Dolby Sound system coupled with Digital Noise Reduction system gives loud, powerful and crystal clear sound."},
{"name": "TCL S6500 40inches FHD Smart Android TV", "link": "/product/32547348/597c437c64f0747950fd616e02d0a8ca?query=TEVEIFRW&position=74", "price": "Rs. 58,990", "image_link": "https://cdn.pakistanistores.com/data/daredevil/thumbs//0968e7473cc32d73b53d3acce271055f.png", "description": "Latest of TCL S6500 40inches FHD Smart Android TV in Pakistan is 58,990 PKR updated recently on August 2022. Basic specification is FHD,  HDR (High Dynamic Range),  Smart TV (Youtube, Internet Browsing e.t.c), 40,."},
{"name": "Samsung 65 Inch 65NU7300 LED TV", "link": "/price/samsung-65-inch-65nu7300-led-tv", "price": "Rs. 2,19,989", "image_link": "/public/data/images/thumbs/7f88d3664c08e9591494217b6a72f660.png", "description": "65NU7300 is a curved, smart UHD LED TV from Samsung having a screen size of 65 inches. It comes equipped with UHD resolution to provide a crisp, sharp and clear image with smallest details. RGB UHD maintains the quality and vibrancy of a picture and for a remarkable HDR expression, HDR 10+ optimizes every scene. With PurColor technology, you can see the richness of nature in detail. UHD Dimming optimizes the color and sharpness to provide a perfect contrast. Auto depth Enhancer makes the images lifelike. Moreover, with Samsung Smart Hub, you'll search less and watch more. You can seamlessly connect Samsung smart devices and can enjoy mobile pictures on your TV's large screen. New Apple TV app in 65NU7300 LED TV allows you to buy, rent and watch the latest movies while with AirPlay 2 built-in, you can stream and share content from Apple devices to your TV. All the more, its modern and curved design with all of these features is a perfect choice for you to consider."},
{"name": "Sony 55 Inch 4K UHD Smart Google LED KD-55X85J", "link": "/product/34843745/9157ab6227fb09573d102b2b1c93d162?query=TEVEIFRW&position=195", "price": "Rs. 2,28,800", "image_link": "https://cdn.pakistanistores.com/data/ays/thumbs//dfefcb98a56cb1b39906bd469c3a91d6.png", "description": "Breathtaking colors make everything so real Clear multidimensional sound Experience the thrills of the theatre Thousands of movies and shows, at the sound of your voice. Enjoy video chat with friends and family on the big screen Supreme pictures and sound, whatever the environment"},
{"name": "TCL 65 Inch L65C725 UHD Android TV", "link": "/product/34843741/326984ccee4510ca0fc3e5d4b07fae25?query=TEVEIFRW&position=189", "price": "Rs. 2,19,900", "image_link": "https://cdn.pakistanistores.com/data/ays/thumbs//733f36c2753b496d7709c92109dec778.png", "description": "LED QLED Android TV Chassis RT51 Platform CPU 64-bit A55 4 ~1.3GHz GPU G31x2 800MHz OS Android R RAM/ROM DDR3-1866: 2G Bytes UI Style Android TV UI & TCL TV UI Power Consumption 210 W Certification CB, Dolby Audio, Dolby Vision, HDMI, DTS-HD, CTS (Google Official Certification), Netflix"},
{"name": "TCL QLED 4K Google TV 65 Inch 65C635", "link": "/product/34843738/c1e021b37591ba179efb876027295732?query=TEVEIFRW&position=187", "price": "Rs. 2,17,400", "image_link": "https://cdn.pakistanistores.com/data/ays/thumbs//770e9922977c7772c5501f86a30fd558.png", "description": "Size : 65  Product Type : LED UHD Google TV Chassis : RT51M Platform CPU : 64-bit A55 4 1.3GHz GPU : G31 MP2 800MHz OS : GTV RAM/ROM : 2GByte(DDR3-2133)-48bit UI Style : Amati UI Power Consumption : 120W Certification : CB, HDMI, Dolby Audio, Dolby Vision, DTS-HD,BQB, CTS (Google Official Certification), Netflix"},
{"name": "Samsung QLED TV 4K Smart 55 Inch QA55Q70BAU", "link": "/product/34843744/e61697f35aac82481f7f4d34b34c4656?query=TEVEIFRW&position=188", "price": "Rs. 2,19,200", "image_link": "https://cdn.pakistanistores.com/data/ays/thumbs//5dac1aa7c3a8dde49738b864dbc59258.jpg", "description": "Boost up your gaming The intelligence behind the glorious picture and sound Quantum Processor 4K Exceptional motion enhancements in 4K 120Hz Tear-free, stutter-free, low-latency HDR gaming Discover your favorite contents in one place"},
{"name": "TCL C825 65 INCH Mini Led 4K Android TV", "link": "/product/32547260/e93cff3188b1d255a58d0d0eeb03c466?query=TEVEIFRW&position=198", "price": "Rs. 2,34,999", "image_link": "https://cdn.pakistanistores.com/data/daredevil/thumbs//9c1ccc8a1a9e5870c422809682395295.png", "description": "Latest of TCL C825 65 INCH Mini Led 4K Android TV in Pakistan is 234,999 PKR updated recently on August 2022. The TCL Mini LED 4K TV always ensures users enjoy an exceptional viewing experience, whether they are watching sports, movies, or TV shows, gaming or connecting with friends and family. C825 Mini-LED technology is a full array backlight system in which each pixel has its own illuminating led which gives a brighter and smoother image and with its QLED Panel that consists of light-transmitting inorganic nanocrystals which illuminate with backlight to provide sharper and closer to reality image experience hence increasing color definition to 100% color volume. There wouldn t be any blurs or motion trails while playing the latest and top-tier games on your gaming machine through HDMI 2.1 on your new C825 as it supports 4K gaming at a refresh rate of as high as 120Hz"},
{"name": "Sony 65 Inch 65X7500F LED TV", "link": "/price/sony-65-inch-65x7500f-led-tv", "price": "Rs. 2,02,999", "image_link": "/public/data/images/thumbs/1548962597eca2f8f442d5e0cff4527d773510478b.jpg", "description": "Sony s large-screen LED TV is made to feature an over-all cinematic experience. It has an Ultra HD display so you can watch images as sharp and clear as they were intended. This television set is excellent in terms of its compatibility with other devices because it provides you smart connectivity, along with all other smart tv features. Being an Android TV, it guarantees ease of access. Furthermore, with voice search, you just have to say what you want to see and the system will play it for you. With a 50 hertz refresh rate, 4K X-Reality Pro processor, and a 20 W output, Sony 65X7500F will give an overall pleasurable experience to all members of the family."},
{"name": "Samsung 55 Inch QLED 4K Smart LED QA55Q70AAU", "link": "/product/34843739/b33ecca0abda2fe136d754db410b65f1?query=TEVEIFRW&position=185", "price": "Rs. 2,15,000", "image_link": "https://cdn.pakistanistores.com/data/ays/thumbs//a7640f5daebdea87c3a313b7f8988879.jpg", "description": "Boost up your gaming Picture The intelligence behind the glorious picture and sound Optimized backlight color tone for enhanced contrast A billion shades of color with Quantum Dot Wider range of contrast in cinematic scale Brilliant color from every view Surroundings change, picture stays perfect TV and soundbar orchestrated in perfect harmony"},
{"name": "Samsung QLED TV Smart 4K 55 Inch QA55Q70AAU", "link": "/product/34843740/063208445e781df3d8015e10b27f0660?query=TEVEIFRW&position=184", "price": "Rs. 2,15,000", "image_link": "https://cdn.pakistanistores.com/data/ays/thumbs//db135984fd5dce30330114f8a750a4cb.jpg", "description": "Boost up your gaming Picture The intelligence behind the glorious picture and sound Quantum Processor 4K Optimized backlight color tone for enhanced contrast Dual LED A billion shades of color with Quantum Dot 100% Color Volume with Quantum Dot More comprehensive range of comparison in cinematic scale"},
{"name": "Samsung 65 Inch UHD 4K Smart TV UA65AU7000U", "link": "/product/34843736/f1cfa1bb3fc1899f1f4b034118121a51?query=TEVEIFRW&position=181", "price": "Rs. 2,07,999", "image_link": "https://cdn.pakistanistores.com/data/ays/thumbs//4ce69a0cb48e37daa40adca729cc0120.png", "description": "Screen Size: 65 inch 4K UHD Samsung Smart TV Resolution: 3840 x 2160 OS: Tizen  HDMI: 3 USB: 1 PurColor Crystal Processor 4K PC on TV Motion Xcelerator HDR 10+ 3-Bezeless Design Clean cable solution Tap View Series: 7 Dolby Digital Plus Bluetooth Audio Wireless LAN: WiFi5 Bluetooth: BT4.4 Auto Power Off"},
{"name": "TCL 65 INCH C725 QLED TV", "link": "/product/32547126/3143f3abb5cdee5fb3c6b31ce63f4936?query=TEVEIFRW&position=192", "price": "Rs. 2,24,899", "image_link": "https://cdn.pakistanistores.com/data/daredevil/thumbs//1ed40aeda02d8ee72cab8774ec6b440f.png", "description": "Latest of TCL 65 INCH C725 QLED TV in Pakistan is 224,899 PKR updated recently on August 2022. Elevating Quantum Dot Display Technology to a new level, the TCL C725 QLED 4K TV offers excellent value for those who want high-quality, interactive home entertainment as part of a connected and smart lifestyle.With over 100% color volume, the Quantum Dot Display Technology in the C725 will deliver even more vibrant and diverse colors without the limitations of lower color volume or shorter lifespans found in other color technologies. Dolby Vision ultra-vivid picture and Dolby Atmos immersive audio together with ONKYO deliver an audiovisual feast."},
{"name": "LG 55NANO86TNA 55 Inches UHD 4K NANO CELL Smart LED TV", "link": "/product/31332336/b4c048cca1c0e54d12a05f0deaf7b40f?query=TEVEIFRW&position=186", "price": "Rs. 2,16,999", "image_link": "https://cdn.pakistanistores.com/data/daredevil/thumbs//ffa80cbddfd1b7df5eb0d2ceb7bf63f9.png", "description": "Latest of LG 55NANO86TNA  55 Inches UHD 4K NANO CELL Smart LED TV in Pakistan is 216,999 PKR updated recently on August 2022. Basic specification is 4K UHD,  HDR (High Dynamic Range),  Smart TV (Youtube, Internet Browsing e.t.c), 55,."},
{"name": "Sony 65 Inch 65X7000G LEDTV", "link": "/price/sony-65-inch-65x7000g-ledtv", "price": "Rs. 1,89,999", "image_link": "/public/data/images/thumbs/3d34a79e3213e46153613f3537e7377a.png", "description": "65X7000G LED TV is the perfect choice for an amazing viewing experience. It lets you enjoy pure, natural audio with smooth & even reproduction of all frequencies and rich audio across a wider listening area. Whatever you are watching, your listening will be as lifelike as your viewing. Triluminos Display faithfully reproduces every shade. With 4K HDR, it produces every picture to realism and with 4K X-Reality PRO, images are refined and sharpened for remarkable clarity. This LED TV comes with a cable holder for a neat and tidy look. As a Smart TV, it allows you to access and enjoy Facebook, YouTube, and Netflix on a big screen. Moreover, Smart Plug and Play lets you share your images, music, and videos from multiple devices."},
{"name": "TCL 65C716 LED TV", "link": "/price/tcl-65c716-led-tv", "price": "Rs. 1,81,600", "image_link": "/public/data/images/thumbs/345f321f3f6f265faa6e79fa2b86cad7.png", "description": "65C716 LED TV is an LED TV from TCL that comes equipped with a Quantum Dot display to give you the finest image quality, 4 microphone receivers for exceptional reception and hence voice control of your content, 4K resolution to give stunning details to whatever you are watching, Dramatic Dolby Vision to boost brightness level and to enhance the appearance of Dolby exclusive content, HDR 10+ for a richer and more immersive experience, IPA engine to make the picture more layered and Micro Dimming to ensure a pleasing viewing experience with great contrast especially in dark. Dolby Atmos Audio in your TCL LED TV provides 3D sound for a cinematic sound experience. Another exclusive feature of your TCL LED TV is Magiconnect. You can now control your TV with your phone; take a screenshot of your favorite TV program and share it on social media and cast your favorite movies on the big screen of your TV. With AI-in, you can access your day's upcoming events and check traffic information. Enjoy the largest TV channel in the world i.e. Netflix with 4K UHD HDR quality on your own TCL LED TV. Moreover, with YouTube, you can watch your favorite shows, movies, entertainment programs, news, and much more on your TV with the stunning 4K resolution."},
{"name": "Sony Android Smart 4K HDR LED TV 85inch KD-85X85J", "link": "/product/33830111/7277cfed8628290423795ad3ddb0fac1?query=TEVEIFRW&position=240", "price": "Rs. 8,29,999", "image_link": "https://cdn.pakistanistores.com/data/daredevil/thumbs//bd7d218c468a53c4b392c1f413a4dacc.png", "description": "Latest of Sony Android Smart 4K HDR LED TV 85inch KD-85X85J in Pakistan is 829,999 PKR updated recently on August 2022. Sony's KD-85X85J takes colour to the next level with TRILUMINOS PRO and 4K HDR processor X1. Bring breathtaking 4K pictures and clear multidimentional sound. Feel surrounded by clear, high quality sound from multiple dimensions, putting you right there inside the scene. Our latest Cognitive Processor XR works like the human brain, creating natural and beautiful pictures and sounds just as you see and hear in real life. Furthermore, with Full Array LED, you'll enjoy brighter, higher contrast pictures for extra realism."},
{"name": "Samsung 85 Inch Q80T 4K UHD HDR Smart QLED TV", "link": "/product/30324527/51e05a9104e863972d6e7707adffed27?query=TEVEIFRW&position=239", "price": "Rs. 7,59,990", "image_link": "https://cdn.pakistanistores.com/data/daredevil/thumbs//af06103c7fd2b2d38db3c1f9ee829f18.png", "description": "Latest of Samsung 85 Inch Q80T 4K UHD HDR Smart QLED TV in Pakistan is 759,990 PKR updated recently on August 2022. Basic specification is 4K UHD,  Smart TV (Youtube, Internet Browsing e.t.c), 85,."},
{"name": "TCL P615 70INCH SMART & 4K LED TV", "link": "/product/31554669/f17802d7f4fd58c7e1ca81f888a9afad?query=TEVEIFRW&position=183", "price": "Rs. 2,09,900", "image_link": "https://cdn.pakistanistores.com/data/daredevil/thumbs//d36bcffd8d477140d66535aa445cb82c.png", "description": "Latest of TCL P615 70INCH SMART & 4K LED TV in Pakistan is 209,900 PKR updated recently on August 2022. Basic specification is 4K UHD,  HDR (High Dynamic Range),  Smart TV (Youtube, Internet Browsing e.t.c), 65,."},
{"name": "Samsung 82 Inch 82TU8000 LED TV", "link": "/price/samsung-82-inch-82tu8000-led-tv", "price": "Rs. 6,41,999", "image_link": "/public/data/images/thumbs/2bd7822079bd2ac78248ce174fe19567.jpg", "description": "TU8000 LED TV is one of the 4K Smart LED TVs from Samsung. It features a Magic screen, Crystal display, Crystal processor 4K, HDR, 4K resolution, Remote access, Bixby voice assistant, AirPlay 2, game enhancer, and more. With the Magic Screen function, you can share your favorite moments on the TV screen by placing your photos in a slide show or making a collage. See your favorite content like you're really in the scene as 4K resolution provides you sharp and crisp images. HDR ensures stunning visual details in dark scenes. Now, everything is much easier and simple in your Samsung LED TV with voice control. You can play your favorite content or control your TV and other connected devices just with your voice. Moreover, AirPlay 2 built-in lets you share content from your Apple devices to your TV effortlessly."},
{"name": "Sony 85 Inch 85X8000H LED TV", "link": "/price/sony-85-inch-85x8000h-led-tv", "price": "Rs. 6,49,999", "image_link": "/public/data/images/thumbs/9adbfa5171564a1d0e6729876a8d1e0f.jpg", "description": "This 85  4K LED by Sony belongs to its 800H series. High-priced and expensive, this LED has many distinct features that make it worth its price. These features include TRILUMINOS Display, live color technology, and precision color mapping along with X-tended dynamic range, object-based HDR remaster, and Dynamic Contrast Enhancer. These features provide bright, vivid, and clear images on the screen. Its picture modes include vivid, standard, cinema, graphic, game, Dolby vision bright, and Dolby vision dark among others. Along with this, for high-quality sound processing, it has Dolby Atmos and Dolby Audio. Other features include 4K X-reality PRO for clarity, Motion Flow XR 200 for motion enhancement, and the Android operating system."},
{"name": "SAMSUNG UE65TU8500UXXU 65INCH SMART & 4K", "link": "/product/30105794/37391d9229257c91484ef8da7ff640db?query=TEVEIFRW&position=180", "price": "Rs. 2,05,499", "image_link": "https://cdn.pakistanistores.com/data/daredevil/thumbs//dd39ec7dddeb9b412d48e295621cd0aa.png", "description": "Latest of SAMSUNG UE65TU8500UXXU 65INCH SMART & 4K in Pakistan is 205,499 PKR updated recently on August 2022. Basic specification is 4K UHD,  HDR (High Dynamic Range),  Smart TV (Youtube, Internet Browsing e.t.c), 64.5 Measured Diagonally,."},
{"name": "Sony 65 Inch 65A8H LED TV", "link": "/price/sony-65-inch-65a8h-led-tv", "price": "Rs. 5,10,999", "image_link": "/public/data/images/thumbs/f762b02ffaa55d496c9b1b89ff1f49ea.jpg", "description": "This 65  LED by Sony is a thing of beauty. Although high-end and expensive, this product has many features that make it worth its price and the overall purchase cost-effective. These features include a high-powered processor which provides a sound that is in complete harmony with the images which also helps to enhance the television watching experience of its viewers. It has a beautiful OLED display with accurate colors. Apart from this, it has a wider, more precise range of colors, all thanks to its TRILUMINOS which is powered by X1 processors. With the feature of Dolby Atmos, the viewers feel like they are surrounded by the sounds which give them a theatrical experience from the comfort of their homes."},
{"name": "Samsung 75 Inch 75Q70T LED TV", "link": "/price/samsung-75-inch-75q70t-led-tv", "price": "Rs. 4,59,999", "image_link": "/public/data/images/thumbs/ab77718937c483b900b99ff90775a9fe.jpg", "description": "Samsung is a renowned TV brand and 75Q70T is one of its 4K UHD LED TVs. This LED TV features Quantum HDR, Quantum Processor 4K, Ambient mode, 4K AI upscaling, Active Voice Amplifier, Universal Guide, Real Game Enhancer, SmartThings, Google Assistant, Multi View, and Multiple Voice Assistants. the Quantum processor 4K optimizes the image and gives you an immersive viewing experience and you can enjoy 4K resolution whatever the input source is. 4K AI upscaling automatically analyzes the source and restores the lost detail giving you a 4K resolution picture. With Universal Guide, you will get a list of curated content from streaming channels so you can easily find your favorite content. All the more, the beautiful sleek and modern design of your 75Q70T LED TV draws you into the screen."},
{"name": "SAMSUNG UN 65TU7000FXZA 65 INCH SMART & 4K", "link": "/product/30105790/c6457f6b0d4284e130446b1cdbd1e3df?query=TEVEIFRW&position=178", "price": "Rs. 1,99,999", "image_link": "https://cdn.pakistanistores.com/data/daredevil/thumbs//61b9d22b372ee86ee26ece41528161da.png", "description": "Latest of SAMSUNG UN 65TU7000FXZA 65 INCH SMART & 4K in Pakistan is 199,999 PKR updated recently on August 2022. Basic specification is 4K UHD,  HDR (High Dynamic Range),  Smart TV (Youtube, Internet Browsing e.t.c), 64.5 Measured Diagonally,."},
{"name": "Sony 75 Inch 75X8000H LED TV", "link": "/price/sony-75-inch-75x8000h-led-tv", "price": "Rs. 4,09,999", "image_link": "/public/data/images/thumbs/dbe70b04ae0966f5ae2a1f7c6eb1cdd3.png", "description": "This 75  4K LED by Sony has many features that make it worth its price. These features include TRILUMINOS Display which helps to provide its users with a wide range of precise colors on screen. Another feature that enhances the image quality and makes it vivid, bright and clear is the X1 4K HDR processor. It helps to boost the image while cutting down extra noise. Apart from this, it also has ClearAudio+ which fine-tunes the sound, increases clarity, and makes you feel surrounded by it. Being a Smart, Android TV it has a wide range of apps on Google Play. These apps include Netflix, Prime Video, and YouTube among others. With motion flow XR 200, the action sequences remain smooth which is a feature specifically for users interested in action films and gaming."},
{"name": "Orient Guitar 65S UHD LED TV", "link": "/price/orient-guitar-65s-uhd-led-tv", "price": "Rs. 1,63,800", "image_link": "/public/data/images/thumbs/155596620603f69b820510df966e10546e8e9ba9c7.jpg", "description": "An immersive display coupled with a sophisticated 4K streaming engine backed by a Dolby-enhanced sound surround system is what defines the Orient Guitar 65S UHD. The sleek design, vivid colors, excellent contrast, and support for streaming UHD content right from Netflix and YouTube are some of the highlights of the Orient Guitar 65S. The key features of this power-packed LED TV include a wide color spectrum, HDR technology, HDMI and USB connectivity, and Smart TV support."},
{"name": "Samsung 75 Inch The Frame Art Mode QLED 4K HDR Smart TV 2020", "link": "/product/33438422/899575e3c24847f81b3577c52d560637?query=TEVEIFRW&position=236", "price": "Rs. 6,09,999", "image_link": "https://cdn.pakistanistores.com/data/daredevil/thumbs//16546fd1651920dcc941ace80cd8902a.png", "description": "Latest of Samsung 75 Inch The Frame Art Mode QLED 4K HDR Smart TV 2020 in Pakistan is 609,999 PKR updated recently on August 2022. The Frame is a gorgeous TV that can be endlessly transformed. Turn it on, and enjoy the kind of brilliant display you'd expect from a QLED 4K TV. Or turn it off, and into your very own gallery of stunning art. It?s a canvas to express your creativity in your home, inspiring you to reinvent your space whenever the mood strikes."},
{"name": "Sony 55 Inch 55X8000H LED TV", "link": "/price/sony-55-inch-55x8000h-led-tv", "price": "Rs. 1,59,999", "image_link": "/public/data/images/thumbs/69199dff2bf845b410e1fa44049de610.png", "description": "This 55  4K LED by Sony is available relatively affordable, it also has many features that make it worth its price. These features include a resolution of 3840 x 2160, an aspect ratio of 16:9, LED backlight type of Direct LED, vertical and horizontal viewing angles of 178 degrees. Manufactured in a classy shade of black, it further has 2 USB ports, 4 HDMI ports, 1 digital/optical audio, 1 composite input port, and 1 speaker output port. Apart from all this, it has inbuilt applications that include Netflix, Prime Video, YouTube, Play store."},
{"name": "Sony 75 Inch 75X8000G LED TV", "link": "/price/sony-75-inch-75x8000g-led-tv", "price": "Rs. 3,82,899", "image_link": "/public/data/images/thumbs/53ea13e9dc2e760531b11b2fcf343161.jpg", "description": "Sony 75 Inch 75X8000G LED TV is the perfect choice for an amazing viewing experience. It has a wide range of vibrant colors displayed with amazing sharpness and almost life-like clarity provided by 4K HDR and X-Reality Pro up-scaling. Not only the video, but its audio system also creates a realistic feel. With its dedicated Netflix button on remote control, voice control features and a wide range of apps, you can easily access your desired content."},
{"name": "Sony 50 Inch Smart Android LED KD-50X75", "link": "/product/34843719/04f14798e41ca6454af4f476f760885d?query=TEVEIFRW&position=173", "price": "Rs. 1,69,200", "image_link": "https://cdn.pakistanistores.com/data/ays/thumbs//f0e2e903f1aa5ce7b0f5e31b7ac0fafe.jpg", "description": "Brand: Sony Model: 50-inch Bravia X75 Smart Android LED TV (KD-50X75) Release date: April 2021 Model Name: KD-50X75 Display Size: 50 inch Screen Type: LED Resolution (pixels): 3840 2160 Resolution Standard: Ultra-HD 3D: No Smart TV: Yes Curve TV: No Series: Bravia X75 Launch Year: 2021"},
{"name": "Sony 65 Inch 65X9500H LED TV", "link": "/price/sony-65-inch-65x9500h-led-tv", "price": "Rs. 3,74,999", "image_link": "/public/data/images/thumbs/83cac02c3ad24d66390dfba3b6ab1f6c.jpg", "description": "Manufactured in a sleek and sophisticated design, this 65  4K LED by Sony is available in an elegant shade of black. It has many features that provide its users with a cinematic experience from the comfort of their homes. These features include TRILUMINOS Display, live color technology, and precision color mapping which help in color enhancement and X tended Dynamic Range PRO, Object-based HDR Remaster, and Dynamic Contrast Enhancer which help in producing better contrast. Apart from these, it has Dolby audio and Dolby Atmos for producing high-quality sound. Other features include voice search, sleep timer, and direct backlight type among others."},
{"name": "EcoStar 65 inch 4K Smart LED TV CX-65UD961", "link": "/product/34843718/7c78641dbbef16148ee5ccf1e4795769?query=TEVEIFRW&position=171", "price": "Rs. 1,65,000", "image_link": "https://cdn.pakistanistores.com/data/ays/thumbs//9e22e51e7b46d010ef294792122ed51a.jpg", "description": "Screen Size: 65  Smart 4K TV Resolution: 3840 x 2160 Power Consumption: 150W Android 10.0 Smart Home Connectivity One Button Access Built in Google Play Store DTS Studio Sound HLG Frame-less Design Chrome Cast Built-in Bluetooth 5.0"},
{"name": "Hisense 65A7400F 65 4K Smart Android LED TV", "link": "/product/34843722/b77514c868af97d118703fae433ca8a9?query=TEVEIFRW&position=169", "price": "Rs. 1,61,200", "image_link": "https://cdn.pakistanistores.com/data/ays/thumbs//cb41ef68799bfc359497dd6f50b9472b.jpg", "description": "Android Operating System 4K UHD Bluetooth Voice Remote 26 Watts Speaker Digital Tuner Chromecast Builtin"},
{"name": "TCL 85 INCH 4K HDR TV P725 LED TV", "link": "/product/32534980/77a8b5b6e7eb804c58cb4e51440758a9?query=TEVEIFRW&position=235", "price": "Rs. 5,79,999", "image_link": "https://cdn.pakistanistores.com/data/daredevil/thumbs//8cb3d70ab19a9a7c7e9870217ab58f43.png", "description": "Latest of TCL 85 INCH 4K HDR TV P725 LED TV in Pakistan is 579,999 PKR updated recently on August 2022. Basic specification is 4K UHD,  HDR (High Dynamic Range),  Smart TV (Youtube, Internet Browsing e.t.c), 85 Inch,."},
{"name": "SAMSUNG UA 82TU8000UXTW 82INCH SMART & 4K", "link": "/product/30106808/cfba2885cffd52809d94fd6163aa43c5?query=TEVEIFRW&position=234", "price": "Rs. 5,34,998", "image_link": "https://cdn.pakistanistores.com/data/daredevil/thumbs//7c9f84a94f8231c019c27bb9be3d5086.png", "description": "Latest of SAMSUNG UA 82TU8000UXTW 82INCH SMART & 4K in Pakistan is 534,998 PKR updated recently on August 2022. Basic specification is 4K UHD,  HDR (High Dynamic Range),  Smart TV (Youtube, Internet Browsing e.t.c), 82,."},
{"name": "Samsung 75AU8000 75-inch Ultra HD 4K Smart LED TV 2021", "link": "/product/33315066/64cdb16716fd32238e9281febde38ec2?query=TEVEIFRW&position=231", "price": "Rs. 4,14,999", "image_link": "https://cdn.pakistanistores.com/data/daredevil/thumbs//3f3e46b12a15bcda0a3c0bb95ba90098.png", "description": "Latest of Samsung 75AU8000 75-inch Ultra HD 4K Smart LED TV 2021 in Pakistan is 414,999 PKR updated recently on August 2022. Basic specification is 4K UHD,  HDR (High Dynamic Range),  Smart TV (Youtube, Internet Browsing e.t.c), 75 INCH,."},
{"name": "TCL P725 65INCH SMART & 4K LED TV", "link": "/product/31554667/a2bd008bb2edc682e8560cd0e7f4268a?query=TEVEIFRW&position=172", "price": "Rs. 1,66,999", "image_link": "https://cdn.pakistanistores.com/data/daredevil/thumbs//2e1b73b7983e344f4cdadbfbb478f086.png", "description": "Latest of TCL P725 65INCH SMART & 4K LED TV in Pakistan is 166,999 PKR updated recently on August 2022. Basic specification is 4K UHD,  HDR (High Dynamic Range),  Smart TV (Youtube, Internet Browsing e.t.c), 65,."},
{"name": "Samsung 55 Inch 55Q7C QLED TV", "link": "/price/samsung-55-inch-55q7c-qled-tv", "price": "Rs. 3,69,256", "image_link": "/public/data/images/thumbs/15491379344fb9d8610b3175b66ab345a17ec53f0b.png", "description": "The Samsung Q series is perhaps the most elusive and premium LED TV lines in the world today. The 55Q7C is a popular LED TV from this series that sports the proprietary Samsung QLED technology with a certified 4K resolution, HDR 1500, and Samsung Smart features. If you wish to go above and beyond the traditional viewing experience, then the Samsung 55Q7C is suitable for you. The impeccable contrast, superb picture quality, and clear distinction between blacks and whites in the picture ensure that you have a breathtaking viewing experiences. The curved display also ensures that you have a wide viewing angle which is ideal for watching your favorite movies and TV shows, and playing your favorite games. The design is one of the best in the industry with a bezel-less display, a zero gap wall-mount, a clean 'wireless' back, and an invisible connection due to the minimalistic One Connect Samsung wiring feature. Not just this, but the Smart View, Smart Hub, and Q Engine for processing make it seamlessly easy to view all your favorite shows on your mobile phone, laptop, or online from the Samsung 55Q7C QLED TV."},
{"name": "Sony LED TV KD-55X80J", "link": "/product/34843737/cdf6ef7795c849c37498efa1ee094480?query=TEVEIFRW&position=182", "price": "Rs. 2,08,900", "image_link": "https://cdn.pakistanistores.com/data/ays/thumbs//3461a33bd8a6220bdca4030c0c311494.jpg", "description": "Clear multidimensional sound Experience the thrills of the theatre Dolby Vision  Enjoy video chat with friends and family on the big screen Connect TV to Camera Breathtaking colours TRILUMINOS PRO  4K HDR Processor X1 "},
{"name": "Samsung 70 Inch 70TU7000 LED TV", "link": "/price/samsung-70-inch-70tu7000-led-tv", "price": "Rs. 3,29,999", "image_link": "/public/data/images/thumbs/7bf4a4253017e4232d3aac54d95b8ad2.jpg", "description": "70TU7000 is one of the 4K UHD LED TVs from Samsung. Its screen size is 70 inches. This Crystal UHD LED TV delivers the hidden detail at four times the quality of Full HD TV with its 4K resolution. So you will enjoy the crisp and clear picture. See the stunning details even in the dark scenes with High Dynamic Range. Crystal Display ensures crystal clear colors to provide a more vivid picture. Your Samsung LED TV works seamlessly with Google Assistant, AirPlay 2, and Amazon Alexa. You can ask Amazon Alexa or Google Assistant whatever you want and enjoy a hands-free experience. Apple AirPlay 2 lets you share content from your Apple devices to your LED TV so you will enjoy your favorite content from your devices on your TV with an immersive viewing experience."},
{"name": "TCL 65 Inch P615 4K UHD Android TV", "link": "/product/32534562/5afa1ed0d50b37395484d18e2d3287a4?query=TEVEIFRW&position=168", "price": "Rs. 1,59,999", "image_link": "https://cdn.pakistanistores.com/data/daredevil/thumbs//ca7ba1161b271e72eb833d065a8d9a75.png", "description": "Latest of TCL 65 Inch P615 4K UHD Android TV in Pakistan is 159,999 PKR updated recently on August 2022. Basic specification is 4K UHD,  HDR (High Dynamic Range),  Smart TV (Youtube, Internet Browsing e.t.c), 65,."},
{"name": "ECOSTAR CX-65UD961 65 INCH SMART UHD 4K LED TV", "link": "/product/31427681/5deed8a3811c6dc3df13c82ac674db3b?query=TEVEIFRW&position=174", "price": "Rs. 1,78,499", "image_link": "https://cdn.pakistanistores.com/data/daredevil/thumbs//2f683b2256835f9349a3e105c5811b2b.png", "description": "Latest of ECOSTAR CX-65UD961 65 INCH SMART UHD 4K LED TV in Pakistan is 178,499 PKR updated recently on August 2022. Basic specification is 4K UHD,  HDR (High Dynamic Range),  Smart TV (Youtube, Internet Browsing e.t.c), 65,."},
{"name": "Sony 65 Inch 65X9000H LED TV", "link": "/price/sony-65-inch-65x9000h-led-tv", "price": "Rs. 3,29,999", "image_link": "/public/data/images/thumbs/12f96400b5adbb522b6cafedb1b51166.jpg", "description": "This 65  LED by Sony belongs to the X900H series with 2020 as its model year. Along with enhancing the elegance of any room where it is placed, it has many distinct features that make it a cost-effective purchase for its users. These features include 164 cm of screen size, built-in Chromecast, Apple Airplay, and Direct backlight type. Apart from these, to provide clear, bright, and vivid images on screen, it has an X1 4K HDR processor, 4K X-Reality PRO, live color technology, and TRILUMINOS display. For sound processing, it has Dolby Audio and Dolby Atmos among other features. This android LED TV has onboard storage of 16 GB. It is an overall great package."},
{"name": "Samsung UHD TV 4K Smart 75 Inch UA75AU7000U", "link": "/product/34843767/d1c31f2e739cfeb7a0b2d22e6e21dc34?query=TEVEIFRW&position=226", "price": "Rs. 3,74,200", "image_link": "https://cdn.pakistanistores.com/data/ays/thumbs//70f196d5c53e9443b194dec5718fdde0.jpg", "description": "Fine-tuned color for a vibrant, lifelike picture Feel a lifelike shade of color as intended in a powerful 4K Crystal Processor 4K Smooth motion for a clear picture Feel the reality of 4K UHD Resolution See dark and light in every scene TV and soundbar orchestrated in perfect harmony"},
{"name": "Samsung 75 Inch 75TU7000 LED TV", "link": "/price/samsung-75-inch-75tu7000-led-tv", "price": "Rs. 3,20,250", "image_link": "/public/data/images/thumbs/fd392830bea88da5b5ff1c34ac70d678.jpg", "description": "Enjoy crisp and vivid color expression and powerful picture quality with Samsung 75 Inch 75TU7000 LED TV. This TV comes equipped with amazing features of Crystal display, a big screen of 75 inches, 3-side boundless design, 4K resolution, Crystal processor 4K, HDR, Game enhancer, Smart Hub & One Remote function, AirPlay 2, Tap View, and more. The 4K resolution, HDR, Crystal processor 4K, and Crystal display keep the picture quality up to the mark. so you will enjoy an immersive and lifelike viewing experience as if you are in the middle of the scene. Your 75TU7000 LED TV gives you a neat solution for all the cables by hiding them in a stand. With the Tap View function, you can easily mirror movies or music from your smartphone to your TV and it is as simple as a tap. Moreover, AirPlay 2 built-in allows you to share content from your Apple devices effortlessly and watch it on the big screen of your Samsung TV."},
{"name": "Samsung 55 Inch 55Q7F QLED TV", "link": "/price/samsung-55-inch-55q7f-qled-tv", "price": "Rs. 3,27,441", "image_link": "/public/data/images/thumbs/1549137987ed77dbf25dc8c284d982b2a6e31d8972.jpg", "description": "The Samsung 55Q7F is a member of Samsung's most premium line of LED TVs, the Samsung Q series. This 55-inch flat smart TV comes with Samsung's own 'Quantum LED' (QLED) technology that highlights even the most minute of details in your picture. With features such as 4K resolution, HDR 1500 technology, and Samsung Smart Hub, the Samsung 55Q7F has everything that you want in a LED TV. Despite being priced at a price much higher than that of traditional LED TVs, the 55Q7F justifies its price through the Q Processing Engine and spectacular viewing experience. Samsung has put in close attention to the design of this one as well since the LED TV features a zero gap wall-mount, a minimalistic 'invisible' connection, and a bezel-less 'boundless' design for an elegant overall look."},
{"name": "SAMSUNG UN75TU7000FXZA 75INCH SMART & 4K LED", "link": "/product/30106805/a0f872dc953a21c9771e919611cc5415?query=TEVEIFRW&position=228", "price": "Rs. 3,81,899", "image_link": "https://cdn.pakistanistores.com/data/daredevil/thumbs//d86de666d5e5601792d342383792d403.png", "description": "Latest of SAMSUNG UN75TU7000FXZA 75INCH SMART & 4K LED in Pakistan is 381,899 PKR updated recently on August 2022. Basic specification is 4K UHD,  HDR (High Dynamic Range),  Smart TV (Youtube, Internet Browsing e.t.c), 74.5 Measured Diagonally,."},
{"name": "Orient Guitar 75S UHD LED TV", "link": "/price/orient-guitar-75s-uhd-led-tv", "price": "Rs. 3,15,900", "image_link": "/public/data/images/thumbs/1555966269ef7f4cab60f98a612e6a4f34331de33c.jpg", "description": "The Guitar is Orient's flagship LED TV series and it provides breathtaking image quality with advanced features for streaming and enhancing content. The Guitar 75S UHD is a flagship LED TV that comes with an enormous 75-inch display that is best-suited for home theatres. The excellent color and exquisite contrast of 4K coupled with accurate sound reproduction, HDR technology, and Smart TV support makes the Guitar 75S UHD from Orient one of the best LED TVs out there - it is a choice definitely worth considering for your home entertainment system."},
{"name": "TCL 65 inch 4K QLED Android TV 65C825", "link": "/product/34843765/60c7a86a69ccedea8a4fb2f32113dbeb?query=TEVEIFRW&position=224", "price": "Rs. 3,44,400", "image_link": "https://cdn.pakistanistores.com/data/ays/thumbs//c7d248d80b4f0dbf82b26366c9c88223.png", "description": "Mini LED 4K TV MT9615 Platform CPU 64-bit A73*4 @1.6GHz max GPU G52(2EE)MP2, 550Mhz Android R RAM/ROM DDR4-2666: 3G Bytes Resolution 3840 2160 Integrated Speaker (Bottom Side and Back Side) Dolby Atmos Wi-Fi 2.4GHz/5GHz 2 Years Warranty ( Panel, Parts, Or home service, except breakage of panel and electric spark and burnt)"},
{"name": "Samsung 65 Inch 65MU7350 LED TV", "link": "/price/samsung-65-inch-65mu7350-led-tv", "price": "Rs. 2,99,999", "image_link": "/public/data/images/thumbs/154858124826bef8eb567da42bae07669e53d3a109.png", "description": "With UHD Resolution, 4x that of HD, you can experience vivid and crisp quality of display, now with more color sensitivity through purColour feature and an overall realistic picture quality. This LED TV also comes with Auto Depth Enhancer, which fixes a multi-layered contrast levels to provide a more immersive and in-depth level of viewing experience. It has a beautiful curved design, which besides providing a better experience, also adds to the beauty and elegance of overall design of the product.Samsung 65MU7350 also comes with a smart view feature, through which visual content on mobile phones can be displayed on this product. With Smart View app, you can conveniently control every feature of the LED from your cellphones."},
{"name": "Samsung UA55AU9000U 55 4K Smart UHD LED TV", "link": "/product/34843708/99e168a28a8616d2e0259896a9ad308b?query=TEVEIFRW&position=161", "price": "Rs. 1,45,800", "image_link": "https://cdn.pakistanistores.com/data/ays/thumbs//b4c701fb857a810d2cb9cd30cd9fc756.jpg", "description": "Fully enjoy the thing you love at home Lifelike color, born in a pure state with fine crystal Feel a lifelike shade of color as intended in powerful 4K See dark and light in every scene Xcelerate your gaming experience"},
{"name": "TCL QLED 4K Google TV 75 Inch 75C635", "link": "/product/34843762/d57f8e41fcad5cdc632d2f0aedf2a0de?query=TEVEIFRW&position=219", "price": "Rs. 3,22,400", "image_link": "https://cdn.pakistanistores.com/data/ays/thumbs//770e9922977c7772c5501f86a30fd558.png", "description": "Size : 75  Product Type : LED UHD Google TV Chassis : RT51M Platform CPU : 64-bit A55 4 1.3GHz GPU : G31 MP2 800MHz OS : GTV RAM/ROM : 2GByte(DDR3-2133)-48bit UI Style : Amati UI Power Consumption : 120W Certification : CB, HDMI, Dolby Audio, Dolby Vision, DTS-HD,BQB, CTS (Google Official Certification), Netflix"},
{"name": "Sony LED TV KD-65X80J", "link": "/product/34843761/2f272b9bc51c14e78d2d61b22fb396c5?query=TEVEIFRW&position=216", "price": "Rs. 3,03,400", "image_link": "https://cdn.pakistanistores.com/data/ays/thumbs//3461a33bd8a6220bdca4030c0c311494.jpg", "description": "Clear multidimensional sound Experience the thrills of the theatre Dolby Vision  Dolby Atmos  Use your voice to quickly find what you want to watch Enjoy video chat with friends and family"},
{"name": "TCL 55 inch 55C725 QLED TV", "link": "/product/34843707/d378d65b4f82976f6b3c30d2b00d5fca?query=TEVEIFRW&position=163", "price": "Rs. 1,49,900", "image_link": "https://cdn.pakistanistores.com/data/ays/thumbs//733f36c2753b496d7709c92109dec778.png", "description": "QLED Android TV Chassis RT51 Platform CPU 64-bit A55 4 ~1.3GHz GPU G31x2 800MHz OS Android R RAM/ROM DDR3-1866: 2G Bytes UI Style Android TV UI & TCL TV UI Power Consumption 155 W Certification CB, Dolby Audio, Dolby Vision, HDMI, DTS-HD, CTS (Google Official Certification), Netflix"},
{"name": "TCL 55 INCH C725 QLED TV", "link": "/product/32547128/fbe257d7a0f68910f894352f14f58803?query=TEVEIFRW&position=165", "price": "Rs. 1,54,899", "image_link": "https://cdn.pakistanistores.com/data/daredevil/thumbs//91f4c78558d66633f623f95422c49150.png", "description": "Latest of TCL 55 INCH C725 QLED TV in Pakistan is 154,899 PKR updated recently on August 2022. Elevating Quantum Dot Display Technology to a new level, the TCL C725 QLED 4K TV offers excellent value for those who want high-quality, interactive home entertainment as part of a connected and smart lifestyle.With over 100% color volume, the Quantum Dot Display Technology in the C725 will deliver even more vibrant and diverse colors without the limitations of lower color volume or shorter lifespans found in other color technologies. Dolby Vision ultra-vivid picture and Dolby Atmos immersive audio together with ONKYO deliver an audiovisual feast."},
{"name": "TCL 75 INCH C725 QLED TV", "link": "/product/32547127/dbe0acb482b86789461dcf330a8496f3?query=TEVEIFRW&position=221", "price": "Rs. 3,29,999", "image_link": "https://cdn.pakistanistores.com/data/daredevil/thumbs//c176e24d52258b945a578fa1abe59bca.png", "description": "Latest of TCL 75 INCH C725 QLED TV in Pakistan is 329,999 PKR updated recently on August 2022. Elevating Quantum Dot Display Technology to a new level, the TCL C725 QLED 4K TV offers excellent value for those who want high-quality, interactive home entertainment as part of a connected and smart lifestyle.With over 100% color volume, the Quantum Dot Display Technology in the C725 will deliver even more vibrant and diverse colors without the limitations of lower color volume or shorter lifespans found in other color technologies. Dolby Vision ultra-vivid picture and Dolby Atmos immersive audio together with ONKYO deliver an audiovisual feast."},
{"name": "MULTY NET QA7 65INCH SMART & 4K LED TV", "link": "/product/31332335/c68af30e66ad2c8ead190e2c959d4e29?query=TEVEIFRW&position=164", "price": "Rs. 1,49,900", "image_link": "https://cdn.pakistanistores.com/data/daredevil/thumbs//f1c2c0bdf4a903831df3d0e3fa5321a7.png", "description": "Latest of MULTY NET QA7 65INCH SMART & 4K LED TV in Pakistan is 149,900 PKR updated recently on August 2022. Basic specification is 4K UHD,  HDR (High Dynamic Range),  Smart TV (Youtube, Internet Browsing e.t.c), 65,."},
{"name": "TCL L75C2US LED TV", "link": "/price/tcl-l75c2us-led-tv", "price": "Rs. 2,82,600", "image_link": "/public/data/images/thumbs/1555967558c0727f54dfa741f4faf34e95dd2f8a18.jpg", "description": "A sleek, beautiful, and impeccable Ultra HD Smart LED TV from TCL. The L75C2US is TCL's flagship LED TV with a gigantic screen size of 75-inch, a powerful 4K streaming engine, Android TV OS, HDR Pro technology, Harman Kardon Dolby-enhanced sound, Micro-Dimming, and Wide Color Gamut. The TCL L75C2US provides a smooth and crystal clear viewing experience with exquisite detail. If you are looking for the perfect addition to your home cinema then the TCL L75C2US is a choice worth considering - its features and quality are right up there with the very best LED TVs out there."},
{"name": "Samsung QLED TV 4K Smart 65 Inch QA65Q70BAU", "link": "/product/34843758/a63e4d2fda31d84e1dcf112db9986711?query=TEVEIFRW&position=213", "price": "Rs. 2,95,000", "image_link": "https://cdn.pakistanistores.com/data/ays/thumbs//5dac1aa7c3a8dde49738b864dbc59258.jpg", "description": "Boost up your gaming The intelligence behind the glorious picture and sound Quantum Processor 4K Exceptional motion enhancements in 4K 120Hz Tear free, stutter free, low latency HDR gaming Discover your favorite contents in one place"},
{"name": "TCL 75P735 75 Andoid UHD LED TV", "link": "/product/34843757/ddb3f04c975273eac7d09209acf3e7db?query=TEVEIFRW&position=210", "price": "Rs. 2,82,900", "image_link": "https://cdn.pakistanistores.com/data/ays/thumbs//d1d5e4bd3c77fa4ab9174da474b1dc25.png", "description": "4K HDR WCG Dolby Vision/Atmos MEMC HDMI 2.1 OK Google Google Duo EDGELESS DESIGN"},
{"name": "TCL QLED 4K Google TV 55 Inch 55C635", "link": "/product/34843704/43862e8fb117854a65e366da65b29cd5?query=TEVEIFRW&position=162", "price": "Rs. 1,47,900", "image_link": "https://cdn.pakistanistores.com/data/ays/thumbs//770e9922977c7772c5501f86a30fd558.png", "description": "Size : 55  Product Type : LED UHD Google TV Chassis : RT51M Platform CPU : 64-bit A55 4 1.3GHz GPU : G31 MP2 800MHz OS : GTV RAM/ROM : 2GByte(DDR3-2133)-48bit UI Style : Amati UI Power Consumption : 120W Certification : CB, HDMI, Dolby Audio, Dolby Vision, DTS-HD,BQB, CTS (Google Official Certification), Netflix"},
{"name": "TCL 75 INCH 4K HDR TV P725", "link": "/product/32534981/0328b4a078bcb76ac7a45ab6b7fe2477?query=TEVEIFRW&position=214", "price": "Rs. 2,99,900", "image_link": "https://cdn.pakistanistores.com/data/daredevil/thumbs//f274bf63261d2d7e783f4d3584f9ce61.png", "description": "Latest of TCL 75 INCH 4K HDR TV P725 in Pakistan is 299,900 PKR updated recently on August 2022. Basic specification is 4K UHD,  HDR (High Dynamic Range),  Smart TV (Youtube, Internet Browsing e.t.c), 75-INCH,."},
{"name": "EcoStar 75 Inch 75UD921 LED TV", "link": "/price/ecostar-75-inch-75ud921-led-tv", "price": "Rs. 2,59,999", "image_link": "/public/data/images/thumbs/1549308323cc7269e1f12f9ccac2a8f5c24c0784a5.jpg", "description": "The EcoStar 75UD921 is a LED TV right from the top-tier of the EcoStar LED lineup. This premium LED TV is a complete all-in-one package that comes with UHD resolution, a gigantic 75-inch display size, HDR, Bluetooth and USB and HDMI connectivity, and smart features. This LED TV is packed with image enhancement and picture improvement features including the Motion Reality engine, the RealColor engine, the Sound Max engine, and Image Refinery algorithms from EcoStar. Consequently, the picture quality is right up there with the very best with excellent contrast, highly accurate color reproduction, and magnificent detail in everything you watch. Whether you are looking to watch your favorite movies on NetFlix, or enjoy the match on your cable connection, the EcoStar 75UD921 LED TV is a great LED TV to have in your home lounge."},
{"name": "Haier LE75K6600UG 75 4K UHD Android LED TV", "link": "/product/34843754/01db1bd40a4151e4b3eafed7a2ac10c7?query=TEVEIFRW&position=208", "price": "Rs. 2,69,900", "image_link": "https://cdn.pakistanistores.com/data/ays/thumbs//c83d265cef7fc995498da37375065296.jpg", "description": "Wide Color Gamut Wide Color Gamut UHD Resolution UHD Resolution Netflix & YouTube Netflix & YouTube Screen Size: 75  Type: DLED System of Digital TV  VIDEO/AUDIO): DVB-T+C+T2 H.265+S2 System of Analog TV VIDEO/AUDIO): PAL/SECAM Smart TV: Android 9.0"},
{"name": "TCL 40 Inch S65A Smart LED TV", "link": "/price/tcl-40-inch-s65a-smart-led-tv", "price": "Rs. 53,999", "image_link": "/public/data/images/thumbs/0a74864ffb210b0307bec5376748a7ec.png", "description": "S65A Smart LED TV is a Smart LED TV from TCL, a renowned brand in electronics. With Full-screen design, TCL TV provides the best immersive viewing experience. HDR delivers greater picture contrast, enhances image details, and bring vivid colors to life. With Micro Dimming technology, you will enjoy a fantastic experience with great contrast, especially in dark. Dolby Audio system delivers crystal clarity, easy to hear the dialogue, and realistic sound for a perfect hearing experience. With Google Assistant and Alexa, you can easily control your TV with your voice. This Android TV offers you to play games and tracks your progress so you can pick up where you left. By using Voice Search, you can easily get relative apps and videos without tiresome typing. YouTube and Netflix built-in let you access and watch your favorite movies, documentaries, gaming entertainment, news, and more. Operate your TV by using your Smartphone with T-cast. Overall S65A LED TV s modern design with all of these awesome features is a perfect choice for you to consider."},
{"name": "EcoStar CX-75UD960 -75Inch Android UHD 4K Smart LED TV", "link": "/product/30297627/a3b14d2cd713d34f16ff8bee8d676d78?query=TEVEIFRW&position=211", "price": "Rs. 2,91,999", "image_link": "https://cdn.pakistanistores.com/data/daredevil/thumbs//a64fdf5c7868490dc5b7f902cb1acf12.png", "description": "Latest of EcoStar CX-75UD960 -75Inch Android UHD 4K Smart  LED TV in Pakistan is 291,999 PKR updated recently on August 2022. Basic specification is 4K UHD,  HDR (High Dynamic Range),  Smart TV (Youtube, Internet Browsing e.t.c), 75,."},
{"name": "Samsung Q70T 65inches 4K UHD HDR Smart QLED", "link": "/product/30553567/9df76fe6087a6a91e1f46ab0e1ed372c?query=TEVEIFRW&position=212", "price": "Rs. 2,94,990", "image_link": "https://cdn.pakistanistores.com/data/daredevil/thumbs//2e2a11326c694dc36d1e606f2c61e485.png", "description": "Latest of Samsung Q70T 65inches 4K UHD HDR Smart QLED in Pakistan is 294,990 PKR updated recently on August 2022. Basic specification is 4K UHD,  HDR (High Dynamic Range),  Smart TV (Youtube, Internet Browsing e.t.c), 75,."},
{"name": "TCL L40S6500 LED TV", "link": "/price/tcl-l40s6500-led-tv", "price": "Rs. 53,990", "image_link": "/public/data/images/thumbs/1555966835c0cccd81cf038cad1232585c58bd7991.jpg", "description": "The TCL L40S6500 is a mid-range LED TV from the TCL S6500 Zalmi TV series. Designed specifically for streaming cricket matches in high-resolution, the TCL L40S6500 is a great choice for anyone that is looking to watch their favorite sports or shows in 1080p. The 40-inch FHD display is coupled with TCL's powerful sound engine that provides an excellent viewing experience to audiences. The economical pricing makes the TCL L40S6500 a suitable choice to consider if you are looking for a good-quality Smart LED TV."},
{"name": "Changhong U75K91 75 Inch Smart & 4k LED", "link": "/product/30553568/895771063416dfbc03c61c8fca2e1fff?query=TEVEIFRW&position=206", "price": "Rs. 2,64,999", "image_link": "https://cdn.pakistanistores.com/data/daredevil/thumbs//ff1b594d8cc67b70aceec06b84b9dcf8.png", "description": "Latest of Changhong U75K91 75 Inch Smart & 4k LED in Pakistan is 264,999 PKR updated recently on August 2022. Basic specification is 4K UHD,  HDR (High Dynamic Range),  Smart TV (Youtube, Internet Browsing e.t.c), 75,."},
{"name": "TCL 55 inch QLED TV 55C825", "link": "/product/34843752/26d25a988e5868643f1317e3d41667f5?query=TEVEIFRW&position=201", "price": "Rs. 2,55,900", "image_link": "https://cdn.pakistanistores.com/data/ays/thumbs//cf00d270e9f0f0a229ee6c67abed87bb.png", "description": "Mini LED 4K TV Chassis MT9615 Platform CPU 64-bit A73*4 @1.6GHz max GPU G52(2EE)MP2, 550Mhz OS Android R RAM/ROM DDR4-2666: 3G Bytes UI Style Android TV UI & TCL TV+ 3.x UI Power Consumption 230W Certification CB, Dolby Atmos, Dolby Vision IQ, HDMI, DTS-HD,IMAX, CTS (Google Official Certification), Netflix"},
{"name": "EcoStar 40 CX-40U870 4K Android LED TV", "link": "/price/ecostar-40-cx-40u870-4k-android-led-tv", "price": "Rs. 53,860", "image_link": "/public/data/images/thumbs/d30b9b95a4eaf073e57402fa0a129285.jpg", "description": "This 40-inch Led by EcoStar has all the features that make it unique and different from the rest of the products in the market. Not only is it full HD and has a screen resolution of 1920 x 1080 but it also has Mali 450 quad-core and android 9.0. With built-in Wi-Fi/LAN, it also has 1 GB RAM and 8 GB ROM. Along with these, it has 2 USB connectivity ports, 2 HDMI input, HDMI, and ARC. Its pre-installed apps include google play, Netflix, YouTube as well as prime video. Moreover, this Frameless LED weighs 40 KGs and has a 1-year brand warranty."},
{"name": "Sony 32 Inch 32R302E LED TV", "link": "/price/sony-32-inch-32r302e-led-tv", "price": "Rs. 52,999", "image_link": "/public/data/images/thumbs/15492037747359fcf23cdfea59554f9d399665ec10.png", "description": "The Sony KLV-32R302E is a midrange LED TV from the Sony Bravia series that puts the focus on simplicity and quality. The image quality of the LED TV is quite impressive since the picture comes out to be sharp and clear with a natural sound. The Sony 32R302E is designed to be durable with the X-Protection Pro feature that protects the LED TV from dust, power surges, and humidity. Additionally, it also supports playback directly from USB and smartphones which enables you to stream your favorite content on this LED TV. If you are looking for an affordable yet high-quality LED TV under the 50K budget range than the Sony 32R302E is a viable option to consider."},
{"name": "Samsung 65 Inch QLED 4K Smart LED QA65Q70AAU", "link": "/product/34843760/177103b1d2077e73a182974575647ade?query=TEVEIFRW&position=202", "price": "Rs. 2,56,000", "image_link": "https://cdn.pakistanistores.com/data/ays/thumbs//a7640f5daebdea87c3a313b7f8988879.jpg", "description": "Boost up your gaming Picture The intelligence behind the glorious picture and sound Optimized backlight color tone for enhanced contrast A billion shades of color with Quantum Dot A wider range of contrast in cinematic scale Brilliant color from every view The surroundings change, but the picture stays perfect TV and soundbar orchestrated in perfect harmony"},
{"name": "HAIER LE75K6600UG", "link": "/product/30312679/3e9e108e3c0c470a01cf01c8185c4aaf?query=TEVEIFRW&position=204", "price": "Rs. 2,64,899", "image_link": "https://cdn.pakistanistores.com/data/daredevil/thumbs//1fa73d67de6910ce2d922d5793e5ddad.png", "description": "Latest of HAIER LE75K6600UG in Pakistan is 264,899 PKR updated recently on August 2022. Basic specification is 4K UHD,  HDR (High Dynamic Range),  Smart TV (Youtube, Internet Browsing e.t.c), 75,."},
{"name": "HAIER 43D2M 43INCH STANDARD", "link": "/product/30312673/584ebb13774c76d06fe15a8e126dace1?query=TEVEIFRW&position=69", "price": "Rs. 54,999", "image_link": "https://cdn.pakistanistores.com/data/daredevil/thumbs//bf762bb46ccd18c18ade290953f130f8.png", "description": "Latest of HAIER 43D2M 43INCH STANDARD in Pakistan is 54,999 PKR updated recently on August 2022. Basic specification is 4K UHD,  HDR (High Dynamic Range),  Smart TV (Youtube, Internet Browsing e.t.c), 43,."},
{"name": "SAMSUNG 65Q60R 65INCH SMART & 4K", "link": "/product/30106803/8d4d39effee6c9254163ef7afd3290fd?query=TEVEIFRW&position=207", "price": "Rs. 2,66,999", "image_link": "https://cdn.pakistanistores.com/data/daredevil/thumbs//33c2d0a0ec87afc1116693c733a786dc.png", "description": "Latest of SAMSUNG 65Q60R 65INCH SMART & 4K in Pakistan is 266,999 PKR updated recently on August 2022. Basic specification is 4K UHD,  HDR (High Dynamic Range),  Smart TV (Youtube, Internet Browsing e.t.c), 64.5 Measured Diagonally,."},
{"name": "EcoStar 40 Inch 4K Smart LED CX-40U871 A+", "link": "/product/34843293/82bfc4216e766b1d5dee6fa48b510131?query=TEVEIFRW&position=66", "price": "Rs. 53,900", "image_link": "https://cdn.pakistanistores.com/data/ays/thumbs//dbfe62b01a51024ffb31ea409f574236.jpg", "description": "Screen Size: 40  Frameless: Yes LED: Full HD Resolution: 1920 x 1080 (Full HD) GPU: Mali 450 Quad-core OS: Android 9.0 Built-in Wi-Fi/LAN: Yes RAM: 1 GB ROM: 8 GB"},
{"name": "TCL C825 55 INCH Mini Led 4K Android TV", "link": "/product/32547411/58f8f7b73457b34c3424215da27d2589?query=TEVEIFRW&position=205", "price": "Rs. 2,64,900", "image_link": "https://cdn.pakistanistores.com/data/daredevil/thumbs//8d69896e8c84055ba34d564be049d992.png", "description": "Latest of TCL C825 55 INCH Mini Led 4K Android TV in Pakistan is 264,900 PKR updated recently on August 2022. The TCL Mini LED 4K TV always ensures users enjoy an exceptional viewing experience, whether they are watching sports, movies, or TV shows, gaming or connecting with friends and family. C825 Mini-LED technology is a full array backlight system in which each pixel has its own illuminating led which gives a brighter and smoother image and with its QLED Panel that consists of light-transmitting inorganic nanocrystals which illuminate with backlight to provide sharper and closer to reality image experience hence increasing color definition to 100% color volume. There wouldn t be any blurs or motion trails while playing the latest and top-tier games on your gaming machine through HDMI 2.1 on your new C825 as it supports 4K gaming at a refresh rate of as high as 120Hz."},
{"name": "Samsung 32 T5300 Smart LED TV", "link": "/price/samsung-32-t5300-smart-led-tv", "price": "Rs. 52,000", "image_link": "/public/data/images/thumbs/5ce93f21e822b380be31799672304a8a.jpg", "description": "Samsung 32 T5300 Smart LED TV comes equipped with Full HD resolution, HDR, Purcolor, Smart Hub & one remote function, contrast enhancer, Google Assistant, and more. With Full HD resolution, you will find two times more clarity while watching your favorite programs. HDR enables you to enjoy visual details even in dark scenes. You can mirror your computer's display on your TV with Remote Access. This LED TV also works with Amazon Alexa and AirPlay 2. Moreover, Google Assistant gives a hands-free experience. Finally, the slim and beautiful design of the Samsung 32 T5300 Smart LED TV makes it a great fit for your home and office."},
{"name": "EcoStar 40 Inch 4K Smart LED CX-40U872 A+", "link": "/product/34843304/662b5b3145b090efb3a362d237e705bc?query=TEVEIFRW&position=70", "price": "Rs. 55,000", "image_link": "https://cdn.pakistanistores.com/data/ays/thumbs//657db8664f0b73dd7f18d90973afc985.jpg", "description": "Dolby Digital HD Audio Power Output: 2x8W Auto Volume Level: Yes Dolby Audio: 5.1 Surround USB Connectivity: 2 (2.0) HDMI & ARC: Yes/Yes Wifi: Yes Bluetooth Built-In: Yes (5.0) HDMI Input: 2"},
{"name": "Sony Bravia 40 Inch Full HD LED TV KLV-40R352C", "link": "/product/34843327/eb890d7dd47ee8bdd0624d6e3a30b9ac?query=TEVEIFRW&position=64", "price": "Rs. 53,800", "image_link": "https://cdn.pakistanistores.com/data/ays/thumbs//698267827097beaafa721287945512fa.jpg", "description": "X-Protection PRO Full HD 1080 Clear Resolution Enhancer Clear Phase USB Super Multi-Format PLAY"},
{"name": "TCL 40 A5 Andorid LED TV", "link": "/price/tcl-40-a5-andorid-led-tv", "price": "Rs. 49,999", "image_link": "/public/data/images/thumbs/25666012ffb60e71e9a784bda24b46ec.png", "description": "This 40 inches Android LED has many features that make it a worthwhile purchase. These features include android TV which enables the viewers to enjoy unlimited and convenient entertainment, a full screen that has no frame, and HDR which improves the richness and brightness of the images being displayed on the screen. Moreover, it has IPQ engine, micro dimming, super narrow bezel, dedicated sports mode as well as Dolby audio which delivers immersive 5.1 surround sound. It has added features of Google Assistant as well as Voice Remote. To increase the entertainment quotient, it has inbuilt applications such as Netflix and YouTube."},
{"name": "Orient 40 Blaze FHD Black LED TV", "link": "/price/orient-40-blaze-fhd-black-led-tv", "price": "Rs. 48,000", "image_link": "/public/data/images/thumbs/d95c9dd15aed08dbfd15b5a99c60af92.jpg", "description": "This 40-Inch LED by Orient has many distinct features that make it a worthwhile purchase. With a full-screen display, it provides its users with vivid and bright images on the screen. This is also backed up by full color optimizer. Along with this, its feature of Dolby audio enhances the overall television watching experience of the users tenfold. It provides a cinematic experience from the comfort of your home. Other features include HDMI and USB options as well as inbuilt applications such as Netflix, prime video, and google play among others. The classy and stylish design boosts the overall look of the room where it is placed."},
{"name": "TCL Android Smart LED 40 Inch L40S65A", "link": "/product/34843295/c2c84a438430a576cf45f0ad376d5e28?query=TEVEIFRW&position=62", "price": "Rs. 52,990", "image_link": "https://cdn.pakistanistores.com/data/ays/thumbs//5b0d173ea83f2ad98e0198fb962cfa8c.jpg", "description": "AI Smart Android TV Full Screen AI-IN YouTube Netflix Android TV"},
{"name": "TCL 40 Inch Smart Android LED TV 40S6500", "link": "/product/34843284/670e8d31e9fab5cef175fd482977afae?query=TEVEIFRW&position=60", "price": "Rs. 51,990", "image_link": "https://cdn.pakistanistores.com/data/ays/thumbs//3e8dbebb7b9b9aab86928e2c51d4e6bc.jpg", "description": "Android LED TV Full HD TV Google Assistant HDR10+ Dolby Digital Sound Bluetooth 2 USB/HDMI Inputs YouTube/Netflix 1080 HD resolution energy efficiency 8GB of internal storage"},
{"name": "Samsung 32 Inch 32N5300 LED TV", "link": "/price/samsung-32-inch-32n5300-led-tv", "price": "Rs. 43,999", "image_link": "/public/data/images/thumbs/fc1892a7f8566279817d0a8b344a7e6f.jpg", "description": "32N5300 LED TV is a flat, Smart LED TV from Samsung, a famous brand of electronics. Enjoy vivid and vibrant FHD resolution with twice the resolution of HD TV. Ultra Clean View provides a higher quality image with less distortion. This LED TV lets you enjoy your favorite shows with natural colors. Micro Dimming technology ensures a display with deeper blacks and brighter whites. You can access all your streaming services faster and easier using the Samsung Remote control. You can connect your smartphone with your 32N5300 LED TV to access and control your content on a big screen. All the more, the Quad-Core processor allows you to enjoy a fluid browsing experience and more connected home entertainment experience."},
{"name": "EcoStar 43 Inch 43U571 LED TV", "link": "/price/ecostar-43-inch-43u571-led-tv", "price": "Rs. 41,999", "image_link": "/public/data/images/thumbs/1548962948bab26d57400f0620ceb1f56bb5102e45.jpg", "description": "Ecostar s 43-inch LED TV is a budget-friendly set. With a full HD 1080p display, enjoy sharp quality pictures through the motion engine technology on the EcoStar 43U751. The fast motion pictures ensure a high-quality experience for users. In addition to the an A-Grade panel reduces the amount of light scattering on screen, hence providing a wide viewing angles and good color displays. This LED TV set also offers USB connection so that one can watch HD videos and listen to MP3 songs. You can also project your personal computer and laptop screen on this LED TV. This television set is most suitable for those who want a limited-feature set (i.e. with smart features or android connectivity) but with all basic facilities available."},
{"name": "TCL L40D3000 LED TV", "link": "/price/tcl-l40d3000-led-tv", "price": "Rs. 42,990", "image_link": "/public/data/images/thumbs/1555966751413592209f2016a65d12d45875e57f6b.jpg", "description": "The TCL L40D3000 is a mid-range LED TV from TCL's popular D3000 series. This basic LED TV comes with a range of features such as a built-in woofer, FHD resolution, and USB and HDMI connectivity. The 40-inch display is of high-quality with LED backlighting, great contrast, and adequate brightness for streaming all of your 1080p TV shows and movies."},
{"name": "Orient Action 32 Android LED TV", "link": "/price/orient-action-32-android-led-tv", "price": "Rs. 41,199", "image_link": "/public/data/images/thumbs/f830fdac7ce527aa39672ad6bfbbb79c.jpg", "description": "This LED by Orient belongs to its action series. It has many distinct features that provide its users with a theatrical experience from the comfort of their homes. These features include a quad-core processor which enhances the gaming experience as well as the smoothness, built-in Netflix which brings a huge number of movies, series, and documentaries to your screen, and built-in amazon prime which again helps to fulfill the entertainment quotient. It is highly recommended for gamers as it has an uninterruptable high-end gaming feature with 2 GB RAM and 8 GB ROM. Other features include Fast Cast, built-in Chromecast, digital television, and full-screen display."},
{"name": "Changhong Ruba Smart LED TV 32 Inches L32H7KI", "link": "/product/34843251/7e409f0bcba426a9842bf126bdd6caca?query=TEVEIFRW&position=52", "price": "Rs. 46,499", "image_link": "https://cdn.pakistanistores.com/data/ays/thumbs//66212ecf19ba035df99462dfeaca1003.jpg", "description": "Zero Bezel (Full Screen) Smart LED Android 9.0 Triple Protector Google Assistance USB Media Player HDR 10+ Display UMAX Sound 3.0 Google Assistant Urdu Language Menu Stunning Edgeless Design 1 Year Panel And 2 Years Part Warranty"},
{"name": "Akira 39MS1303 LED TV", "link": "/price/akira-39ms1303-led-tv", "price": "Rs. 40,999", "image_link": "/public/data/images/thumbs/db36e62c690dfe8b5aae150d9d4deffc.jpg", "description": "The Akira 39 MS1303 is a Smart LED TV. Although its resolution is on the lower side with 720p HD but its build quality and Smart features make up for it. Overall a great TV with viewing options of Netflix and YouTube, connectivity options of HDMI and USB, a built-in Sound bar, and a slim & sleek pretty design. Cut short, simply pleasing."},
{"name": "ECOSTAR CX-32U870A 32", "link": "/product/30101688/2dff9e2bdc7ee7136ff8d6304ab2f4ff?query=TEVEIFRW&position=55", "price": "Rs. 49,900", "image_link": "https://cdn.pakistanistores.com/data/daredevil/thumbs//4b0f0a3532fa7907480b2f774c323295.png", "description": "Latest of ECOSTAR CX-32U870A 32 in Pakistan is 49,900 PKR updated recently on August 2022. Watch TV the smarter way. EcoStar now introduces Android TV. Watch your favourite blockbuster movies, breathtaking sports contests or your favourite TV serials, all in HD.Browse TV like never before with Google Assistant that lets you search and control your TV with your voice. EcoStar TV comes with licensed Netflix, YouTube and Amazon Prime. Experience the world of content in the palm of your hands"},
{"name": "Akira 43MG430 LED TV", "link": "/price/akira-43mg430-led-tv", "price": "Rs. 40,999", "image_link": "/public/data/images/thumbs/15559648295b39a5a51c8e71257dc744a4d55257bd.jpg", "description": "The Akira 43MG430 is a mid-range LED TV from the emerging electronics brand that covers all the basics that you would expect in a TV. With a built-in woofer and a vibrant 43-inch FHD display, the Akira 43MG430 provides a viewing experience that is on par with its competitors, with the competitive edge of better pricing. If you are looking for an economical LED TV on which you can watch 1080p movies and TV shows then the Akira 43MG430 is a suitable choice for you."},
{"name": "TCL 32 A5 Android LED TV", "link": "/price/tcl-32-a5-android-led-tv", "price": "Rs. 40,999", "image_link": "/public/data/images/thumbs/bec17845ab54a586562413260b826c22.jpg", "description": "This 32 inches LED by TCL has many features that make it worth its price. These features include a full-screen LED which enables it to have a bigger screen with no frame to enhance the television watching experience of the viewers. Moreover, a high dynamic range amplifies and improves the picture quality of the images being displayed. Other features include the IPQ engine, micro dimming, super narrow bezel, dedicated sports mode, and Dolby Audio along with Google Assistant which allows you to ask any questions as well as control other home devices. Furthermore, it has Voice Remote, Netflix, and YouTube in 4K HDR."},
{"name": "TCL S5200 32INCH SMART LED TV", "link": "/product/33240435/51d048ff9e0a57bc62a1bab971d11f28?query=TEVEIFRW&position=50", "price": "Rs. 44,990", "image_link": "https://cdn.pakistanistores.com/data/daredevil/thumbs//78ab51a7bab9087d5b720a9776d4df37.png", "description": "Latest of TCL S5200 32INCH SMART LED TV in Pakistan is 44,990 PKR updated recently on August 2022. Basic specification is 2K,  HDR (High Dynamic Range),  Smart TV (Youtube, Internet Browsing e.t.c), 32,."},
{"name": "TCL D3000 40INCH STANDARD HD LED TV", "link": "/product/31569244/05b324126de635edd6adfbaf61dc7399?query=TEVEIFRW&position=56", "price": "Rs. 49,900", "image_link": "https://cdn.pakistanistores.com/data/daredevil/thumbs//4c416dfdd2e1ae9bba96fb0b6face856.png", "description": "Latest of TCL D3000 40INCH STANDARD HD LED TV in Pakistan is 49,900 PKR updated recently on August 2022. Basic specification is 4K UHD,  HDR (High Dynamic Range),  Smart TV (Youtube, Internet Browsing e.t.c), 40,."},
{"name": "HAIER LE32K6600 32 INCH STANDARD LED TV", "link": "/product/30101682/f03c6cc37aa913e8b8a652774bdcc9ca?query=TEVEIFRW&position=54", "price": "Rs. 48,499", "image_link": "https://cdn.pakistanistores.com/data/daredevil/thumbs//e5fc47a096cf85f90bd534b7b4a8e885.png", "description": "Latest of HAIER LE32K6600 32 INCH STANDARD LED TV in Pakistan is 48,499 PKR updated recently on August 2022. Basic specification is FHD,  HDR (High Dynamic Range),  Smart TV (Youtube, Internet Browsing e.t.c), 32,."},
{"name": "TCL 55 P8 LED TV", "link": "/price/tcl-55-p8-led-tv", "price": "Rs. 95,000", "image_link": "/public/data/images/thumbs/52effba84f72695e6b769362945f9805.jpg", "description": "The 55 P8 is a large, beautiful display to have in your room from TCL's infamous Zalmi series. It has a 4K UHD LED to please your eyes. You can watch Cable, Netflix, YouTube or anything you like and really like it with its 4K and HDR 10 for color and scene optimization. It has the Dolby Audio system for a theatrical sound experience and Google Voice Remote."},
{"name": "MULTY NET NX7 32INCH SMART", "link": "/product/31332200/7e16dc23c9290f743f29396ca2ad3bd9?query=TEVEIFRW&position=47", "price": "Rs. 43,499", "image_link": "https://cdn.pakistanistores.com/data/daredevil/thumbs//9ce131a64b9285d3332def5c4b8c323f.png", "description": "Latest of MULTY NET NX7 32INCH SMART in Pakistan is 43,499 PKR updated recently on August 2022. Basic specification is HD,  Smart TV (Youtube, Internet Browsing e.t.c), 32,."},
{"name": "TCL S65A 32INCH SMART LED TV FHD", "link": "/product/33805678/6ec79a9dd307d6a4af2da11b6d0d11e0?query=TEVEIFRW&position=51", "price": "Rs. 44,999", "image_link": "https://cdn.pakistanistores.com/data/daredevil/thumbs//ebb6ffdd18468b0aa02595a05eebcbea.png", "description": "Latest of TCL S65A 32INCH SMART LED TV FHD in Pakistan is 44,999 PKR updated recently on August 2022. Basic specification is FHD,  HDR (High Dynamic Range),  Smart TV (Youtube, Internet Browsing e.t.c), 32 INCH,."},
{"name": "Samsung 32 inch LED UA32T5300", "link": "/product/34843292/5eb3db11367cf4ab4207a8345bcfa678?query=TEVEIFRW&position=59", "price": "Rs. 51,900", "image_link": "https://cdn.pakistanistores.com/data/ays/thumbs//86fac1d9c8179919f59a7b1d5165652e.png", "description": "Get office work done on your TV at home. Remote Access lets you mirror your computer s display on the TV screen wirelessly. You can even tap into your office PC to access files or work on documents using Microsoft Office 365 all from the comfort of your couch"},
{"name": "TCL S6500 32INCH SMART & FHD LED TV", "link": "/product/32547352/618d367f7f1dd5e9b61ff0732abc8330?query=TEVEIFRW&position=49", "price": "Rs. 44,899", "image_link": "https://cdn.pakistanistores.com/data/daredevil/thumbs//ce1bc90ae5c1398c60e491fff34bc7fc.png", "description": "Latest of TCL S6500 32INCH SMART & FHD LED TV in Pakistan is 44,899 PKR updated recently on August 2022. Basic specification is FHD,  HDR (High Dynamic Range),  Smart TV (Youtube, Internet Browsing e.t.c), 32,."},
{"name": "TCL 55 P615 4K Android LED TV", "link": "/price/tcl-55-p615-4k-android-led-tv", "price": "Rs. 90,999", "image_link": "/public/data/images/thumbs/091bd1434952132400be913cda738ad1.png", "description": "This 55 inches 4K android LED TV belongs to the P615 series of TCL. It has many features that work together to enhance the television watching experience of its users. These features include 4K Ultra HD resolution, dynamic color enhancement, HDR, and unlimited content that comprises applications such as Prime Video, Netflix, YouTube, JioCinema, Jio Saavn, and Google Play among others. With 4K upscaling, it has micro dimming, super-narrow bezels, and Dolby Audio. Moreover, it has smart home interconnectivity, Voice Remote, Google Assistant, and built-in Bluetooth. It comes with 2 years TV parts warranty."},
{"name": "Samsung 49 Inch 49NU7100 LED TV", "link": "/price/samsung-49-inch-49nu7100-led-tv", "price": "Rs. 86,990", "image_link": "/public/data/images/thumbs/d86fe5e8f4acdf06cc652b92d5b757a6.png", "description": "49NU7100 is one of the best Smart 4K UHD LED TVs from Samsung having a screen size of 49 inches. True Ultra HD color and clarity lets you enjoy the latest movies in more color and detail than ever before. HDR amplifies your viewing experience so that you can see the detail in every scene. The next advancement in HDR technology, HDR 10+ ensures that every scene is optimized for the finest details and UHD Dimming technology adjusts sharpness and brightness for exceptional picture quality. Moreover, you will discover impressive design from every angle. The NU7100 TV stand lets you clip cables on it for a clean look. Finally, it is a TV with everything in one place. Universal Guide lets you enjoy what you love by recommending popular shows and content. You can enjoy high-speed PC games on your TV's big screen through the Stream Link. In short, this LED TV is one of the best smart LED TVs containing all the awesome features you'd love."},
{"name": "Samsung 43 Inch 43T5300 LED TV", "link": "/price/samsung-43-inch-43t5300-led-tv", "price": "Rs. 86,899", "image_link": "/public/data/images/thumbs/54f8f865abf9b58c35fc2ba59baa07de.jpg", "description": "Samsung 43 Inch 43T5300 LED TV comes equipped with features of Full HD resolution, HDR, one remote function, PurColor, contrast enhancer, Amazon Alexa, Google Assistant, and much more. Full HD resolution makes your favorite movies real so you will enjoy two times the clarity of HD TV. Smart Hub and one remote function allow you to discover tons of different types of content. You will enjoy stunning details even in the dark scenes with HDR. PurColor gives you an immersive viewing experience and you will feel as you were in the middle of the scene. Moreover, the slim and modern design of the 43T5300 LED TV makes it an attractive appearance for your home or office."},
{"name": "TCL 55P715 LED TV", "link": "/price/tcl-55p715-led-tv", "price": "Rs. 1,02,400", "image_link": "/public/data/images/thumbs/65p715_front_global_1_1__59774_zoom.png", "description": "55P715 LED TV is another 4K UHD LED TV from Pakistan's popular TV brand TCL. It comes with a stunning 4K display that is enhanced by the latest HDR10+ so you will enjoy a lifelike viewing experience with enhanced brightness and contrast. It features 4 microphone receivers to give you hands-free control of your content with voice control and Google Assistant. With the Rich color expansion, color vibrancy is optimized for an outstanding viewing experience. Micro Dimming adjusts brightness and darkness so the picture quality is improved especially in dark. With immersive Dolby Audio, you will enjoy the crisp and clear audio experience with great detail. TCL AI technology lets you access your day's upcoming events and check traffic information. With YouTube, you can see what the whole world is watching and enjoy your favorite videos, programs, and news in 4K resolution. Netflix built-in lets you enjoy your favorite content including Netflix original series and documentaries all in 4K HDR quality."},
{"name": "Samsung 43 Inch UHD 4K TV UA43AU7000U", "link": "/product/34843532/c3e30b1c4cfd09ce1b7b536a13496c80?query=TEVEIFRW&position=117", "price": "Rs. 93,800", "image_link": "https://cdn.pakistanistores.com/data/ays/thumbs//4ce69a0cb48e37daa40adca729cc0120.png", "description": "Screen Size: 43 inch 4K UHD Samsung Smart TV Resolution: 3840 x 2160 OS: Tizen  HDMI: 3 USB: 1 PurColor Crystal Processor 4K PC on TV Motion Xcelerator HDR 10+ 3-Bezeless Design Clean cable solution Tap View Series: 7 Dolby Digital Plus Bluetooth Audio Wireless LAN: WiFi5 Bluetooth: BT4.4 Auto Power Off"},
{"name": "Sony 55 Inch 55X7000F LED TV", "link": "/price/sony-55-inch-55x7000f-led-tv", "price": "Rs. 1,44,999", "image_link": "/public/data/images/thumbs/1548583444364b38677f989138ac93efc768e0a783.jpg", "description": "With a 4k HDR display and a 4K (UHD) resolution, this LED TV offers a crystal clear picture quality. Thanks to Sony s 4K X-Reality Pro, watcher can enjoy a quality that gives attention to every little detail on screen. ClearAudio makes sure that the sound quality is just as good, making one s overall experience pleasurable. With Sony s 55X7000F also offers a built-in Wi-Fi, and one button YouTube, instantly connect to the Internet and play your favorite YouTube videos on its wide screen. For further convenience, this smart TV s remote controller comes with direct Netflix and YouTube buttons."},
{"name": "Haier LE55U6900 55inch SMART & 4K LED TV", "link": "/product/30969442/57bc1a6b62df5a839c25f1883c2170ad?query=TEVEIFRW&position=119", "price": "Rs. 94,999", "image_link": "https://cdn.pakistanistores.com/data/daredevil/thumbs//9d2e3c38fad947f5c8855d0b7820466f.png", "description": "Latest of Haier LE55U6900 55inch SMART & 4K LED TV in Pakistan is 94,999 PKR updated recently on August 2022. Ultra HD has a resolution of 3840*2160 which shows clearer, smoother pictures with real-life details"},
{"name": "TCL Smart LED TV 55 inch 55P615", "link": "/product/34843518/0fc1d7679839d1819909bc3fbd196aa3?query=TEVEIFRW&position=116", "price": "Rs. 92,900", "image_link": "https://cdn.pakistanistores.com/data/ays/thumbs//15b57ef3f891f3dac33f86719de03d17.jpg", "description": "55 inch LED Ultra HD display Dolby sound Smart LED HDMI CTS (Google Official Certification) Netflix Cast movies and videos to a bigger screen using MAGICONNECT"},
{"name": "Sony 55 Inch 55X7500H LED TV", "link": "/price/sony-55-inch-55x7500h-led-tv", "price": "Rs. 1,42,999", "image_link": "/public/data/images/thumbs/cfa2b5d224d93c458123f944e79d3be7.png", "description": "This 4K Ultra HD Certified Android LED TV by Sony is manufactured in a stylish and sophisticated design and has many features that make it worth its price. These features include 4K pictures that help to enhance the image quality all thanks to it being powered by a 4K HDR Processor X1. What sets it apart from other LED TVs is that even the images that are filmed in 2K and Full HD are upgraded to 4K resolution with the assistance of its features of 4K X-Reality Pro which makes use of a distinct 4K database. It also has a narrow bezel and slim stand design along with Base Reflex Speaker to round up an overall great LED TV."},
{"name": "SAMSUNG UN43TU7000FXZA 43", "link": "/product/32506444/dd185954a496efe5dc32e60c48a38ff9?query=TEVEIFRW&position=118", "price": "Rs. 94,990", "image_link": "https://cdn.pakistanistores.com/data/daredevil/thumbs//db1ba3e2274b57e0efec7c7aaf3bf5c6.png", "description": "Latest of SAMSUNG UN43TU7000FXZA 43 in Pakistan is 94,990 PKR updated recently on August 2022. Basic specification is 4K UHD,  HDR (High Dynamic Range),  Smart TV (Youtube, Internet Browsing e.t.c), 42.5 Measured Diagonally,."},
{"name": "EcoStar CX-50UD963 A+ 50 Smart 4K LED TV", "link": "/product/34843493/b57881c72bb83d3c585eb2ab1e6e8aa8?query=TEVEIFRW&position=109", "price": "Rs. 84,900", "image_link": "https://cdn.pakistanistores.com/data/ays/thumbs//6dc7280188df027527b1e8a972558023.png", "description": "Latest Android 11 Enjoy the world of IoT with Google Assistant Unlimited Applications Flawless Connectivity Bluetooth 5.1 Built   in Chrome Cast Picture Perfect One Touch Access Quadcore Processor Gives Ultra Smooth Gaming Experience"},
{"name": "EcoStar CX - 65UD951A 4K UHD Smart LED TV", "link": "/price/ecostar-cx-65ud951a-4k-uhd-smart-led-tv", "price": "Rs. 1,29,000", "image_link": "/public/data/images/thumbs/15cfab1b7415ef4009eb30db89fb9100.jpg", "description": "EcoStar CX - 65UD951A is a 65-inch Smart LED TV with 4K UHD Display and 3840 x 2160 screen resolution. Its amazing picture resolution brings out the color in images. Powerful contrast, deep black richness and Quad Core Graphics Processing enhances the viewing experience. With Built-in Licensed Netflix and YouTube connectivity, it lets you stream all the latest TV shows and YouTube videos. It has the perfect resolution for gaming visuals and lets you cast your phone on it's big screen. The amazing Dolby Sound system produces loud and clear sound and its Bezel-less design lets you immerse yourself in what you watch."},
{"name": "Samsung 49 Inch 49N5300 LED TV", "link": "/price/samsung-49-inch-49n5300-led-tv", "price": "Rs. 1,27,046", "image_link": "/public/data/images/thumbs/0b074003b106cfca8259998e25efe689.jpg", "description": "49N5300 LED TV is an impressive innovation of Samsung. Its screen size is 49 inches and it comes with Full HD resolution to provide a crystal clear image. HDR technology enhances the clarity and the PurColor feature adds natural colors, hence, making the picture closest to nature. Sound is also quite good due to the Dolby Digital Plus technology. Moreover, the web browser in this LED TV allows you to stream online content seamlessly. Ethernet connectivity provides a stable internet connection while the Wifi connection ensures consistent wireless connectivity. Samsung Cloud feature allows you to access your phone's gallery on the TV. HDMI and USB allow you to connect multimedia devices and storage devices to this TV. Lastly, 49N5300 LED TV has a sleek and slim design that adds beauty to your interior."},
{"name": "Sony 49 Inch 49X7500H LED TV", "link": "/price/sony-49-inch-49x7500h-led-tv", "price": "Rs. 1,24,999", "image_link": "/public/data/images/thumbs/86f971a518321db407baf4bec08e5e2f.jpg", "description": "This 49  LED by Sony is available as comparatively affordable and it also has many features that make it a cost-effective purchase. These features include Dynamic Contrast Enhancer, Voice Search, DTS Digital Surround, and Acoustic Multi-Audio. Apart from this, to provide its users with a cinematic experience from the comfort of their homes, it has bright and vivid images all thanks to its live color technology and TRILUMINOS Display. Furthermore, it has an Auto mode object-based HDR remaster, 4K X-Reality PRO, and Motion flow XR 800. With a thin bezel and stand, it keeps the focus of the viewers where it should be i.e. the amazing 4K screen."},
{"name": "HAIER LE 50K6600UG 50INCH SMART & 4K", "link": "/product/30102715/19912b5be8b9891933e7eef99cccbc67?query=TEVEIFRW&position=113", "price": "Rs. 89,999", "image_link": "https://cdn.pakistanistores.com/data/daredevil/thumbs//fbcb537ca7de2a6b3aeee15048842b75.png", "description": "Latest of HAIER LE 50K6600UG 50INCH SMART & 4K in Pakistan is 89,999 PKR updated recently on August 2022. Basic specification is 4K UHD,  HDR (High Dynamic Range),  Smart TV (Youtube, Internet Browsing e.t.c), 50,."},
{"name": "TCL 55C716 LED TV", "link": "/price/tcl-55c716-led-tv", "price": "Rs. 1,24,500", "image_link": "/public/data/images/thumbs/35658d1cea56516176e7d0fd78141de9.jpg", "description": "55C716 QLED TV is a 4K UHD LED TV from TCL that comes equipped with amazing features of Quantum Dot technology, 4K resolution, hands-free voice control, 55 inches screen, Dolby vision, Chromecast built-in, Netflix, YouTube, Google Assistant, HDR 10+, Bluetooth, IPQ engine, Micro Dimming, Dolby Atmos, and much more. Quantum Dot technology enhances the color of pictures and provides the finest picture quality. Enjoy controlling your TV totally hands-free with simple voice requests. 4K resolution of TCL QLED TV gives you an amazing viewing experience. The Dolby Vision increases contrasts and boosts the brightness level hence enhances the appearance of content. IPQ engine makes the picture richer while Micro Dimming lets you enjoy darker scenes. Dolby Atmos improves the sound quality making it clearer. Moreover, with Chromecast built-in, Netflix, and YouTube, you will enjoy the complete entertainment you want."},
{"name": "Samsung 55 Inch UHD 4K LED TV UA55AU7000U", "link": "/product/34843697/545e39ada36e0c6ce92eb4eade29a2b2?query=TEVEIFRW&position=155", "price": "Rs. 1,32,400", "image_link": "https://cdn.pakistanistores.com/data/ays/thumbs//f0174979cee3e229ccb9e76bb6575d23.png", "description": "Screen Size: 55 inch Resolution: 3840 x 2160 Power Consumption: 130W 4K Smart TV OS: Tizen  Crystal Display USB: 1 HDMI: 2 HDR Wireless LAN: WiFi5 Bluetooth: BT4.2 Game Enhancer Clean cable solution Smart Hub & One Remote Function Tap View Mobile to TV   Mirroring, DLN Dolby Digital Plus Series: 7"},
{"name": "HAIER LE50U6900 50INCH SMART & 4K", "link": "/product/30312675/74cdd9d1a56011758222f9da6d7163c2?query=TEVEIFRW&position=114", "price": "Rs. 89,999", "image_link": "https://cdn.pakistanistores.com/data/daredevil/thumbs//ef9e020226e210638ea9c3c7d8ce20f4.png", "description": "Latest of HAIER LE50U6900 50INCH SMART & 4K in Pakistan is 89,999 PKR updated recently on August 2022. Basic specification is 4K UHD,  HDR (High Dynamic Range),  Smart TV (Youtube, Internet Browsing e.t.c), 50,."},
{"name": "Sony LED TV KD-43X75", "link": "/product/34843696/ca2f7f7f601fdb56703edbb7014e8c98?query=TEVEIFRW&position=157", "price": "Rs. 1,39,300", "image_link": "https://cdn.pakistanistores.com/data/ays/thumbs//b8098a391740789d64400b797c1cbb58.jpg", "description": "Beautiful colours and contrast, fine details Powerful Processor Clearer 4K signal Boost sound with clear, punchy bass Easy access, easy living Recycle. Renew. Reduce. Display Off Mode Life like colour and contrast"},
{"name": "TCL P615 50INCH SMART & 4K LED TV", "link": "/product/31569246/0cd906e93f320d97b3d4e482556322c3?query=TEVEIFRW&position=112", "price": "Rs. 88,889", "image_link": "https://cdn.pakistanistores.com/data/daredevil/thumbs//ac55fc7998e2c90eaa5891997aebf274.png", "description": "Latest of TCL P615 50INCH SMART & 4K LED TV in Pakistan is 88,889 PKR updated recently on August 2022. Basic specification is 4K UHD,  HDR (High Dynamic Range),  Smart TV (Youtube, Internet Browsing e.t.c), 50,."},
{"name": "Samsung 55 Inches 55TU7000 LED TV", "link": "/price/samsung-55-inches-55tu7000-led-tv", "price": "Rs. 1,20,599", "image_link": "/public/data/images/thumbs/b4e07380ef6c785b5d6ccc7e1e6984e8.jpg", "description": "Samsung 55TU7000 Crystal UHD LED TV features 4K resolution, HDR, Crystal processor 4K, boundless design, Auto Game Mode, OneRemote, universal guide, AirPlay 2, Google Assistant, Amazon Alexa, clean cable solution, and Crystal Display. With Crystal Display, you will enjoy a naturally crisp and vivid image. Auto Game mode lets you enjoy a smooth gaming experience while a clean cable solution reduces the clutter. With a universal guide, you will get a list of curated content so you can easily find your favorite content in one place. Google Assistant lets you control different functions like adjusting volume, changing channels, and more with just your voice. High Dynamic Range ensures visual details even in the dark scenes. All the more, the 4K resolution of your TU7000 LED TV delivers crisp, clear, and lifelike images."},
{"name": "Changhong Ruba U65H7Ti 65 Inch LED TV", "link": "/product/30553552/3d557d7fb948a0ff8ccf274ad36fba74?query=TEVEIFRW&position=156", "price": "Rs. 1,34,999", "image_link": "https://cdn.pakistanistores.com/data/daredevil/thumbs//9d904edd482903a11758e1e78c44bf4a.png", "description": "Latest of Changhong Ruba U65H7Ti 65 Inch LED TV in Pakistan is 134,999 PKR updated recently on August 2022. Basic specification is 4K UHD,  HDR (High Dynamic Range),  Smart TV (Youtube, Internet Browsing e.t.c), 65,."},
{"name": "HAIER LE-65K6600 65 INCH SMART & 4K", "link": "/product/30104759/cd958360f2ffb007fbd9247b738db753?query=TEVEIFRW&position=159", "price": "Rs. 1,44,999", "image_link": "https://cdn.pakistanistores.com/data/daredevil/thumbs//006e3a875711cc51d20a738f9e23ede8.png", "description": "Latest of HAIER LE-65K6600 65 INCH SMART & 4K in Pakistan is 144,999 PKR updated recently on August 2022. Basic specification is 4K UHD,  HDR (High Dynamic Range),  Smart TV (Youtube, Internet Browsing e.t.c), 65,."},
{"name": "TCL 50 INCH C725 QLED TV", "link": "/product/32547409/c1fd899ad757c10e99f8aa28b65294af?query=TEVEIFRW&position=154", "price": "Rs. 1,29,900", "image_link": "https://cdn.pakistanistores.com/data/daredevil/thumbs//a06c9441a57021fdd78a647bb43ca8e6.png", "description": "Latest of TCL 50 INCH C725 QLED TV in Pakistan is 129,900 PKR updated recently on August 2022."},
{"name": "Sony 50 Inch 50W660F LED TV", "link": "/price/sony-50-inch-50w660f-led-tv", "price": "Rs. 1,19,400", "image_link": "/public/data/images/thumbs/1548583267f657b0744175a27d89e7d6004d976a7f.jpg", "description": "This LED TV provides a sharp picture quality, pleasing as a good TV set for your household. It has a direct LED backlight and a frame dimming backlight. With Live Color technology, experience distinguishable color contrast (further improved by a dynamic contrast enhancer) and meticulous color detail in every frame. With an open baffle speaker, Sony 50W660F makes it much enjoyable for your family to enjoy movies, sports and TV shows together. Also, this LED TV is tailor-made for all members of family, with user-friendly controls such as sleep-timer."},
{"name": "SAMSUNG 55 Inch Class TU7000 Crystal UHD 4K Smart TV (2020)", "link": "/product/32741465/9f15c0e18876140053ee919a0fd2099d?query=TEVEIFRW&position=153", "price": "Rs. 1,29,899", "image_link": "https://cdn.pakistanistores.com/data/daredevil/thumbs//9f2bc4c48b39361fb04a969a81518c8d.png", "description": "Latest of SAMSUNG 55 Inch Class TU7000 Crystal UHD 4K Smart TV (2020) in Pakistan is 129,899 PKR updated recently on August 2022. Basic specification is 4K UHD,  HDR (High Dynamic Range),  Smart TV (Youtube, Internet Browsing e.t.c), 55 Inch,."},
{"name": "Samsung 50 Inch UHD 4K Smart LED UA50AU7000U", "link": "/product/34843682/97cbfe1bde2d4a0d601202e02dfdfc84?query=TEVEIFRW&position=147", "price": "Rs. 1,23,200", "image_link": "https://cdn.pakistanistores.com/data/ays/thumbs//7356979c0b054f1c0f6a6fbccf387fdc.jpg", "description": "Open up your smart 4K experience Fine-tuned color for a vibrant, lifelike picture Feel lifelike shade of color as intended in powerful 4K Smooth motion for a clear picture Feel the reality of 4K UHD Resolution See dark and light in every scene TV and soundbar orchestrated in perfect harmony More screen, less bezel Eliminate clutter"},
{"name": "EcoStar 55 Inch 55UD925 LED TV", "link": "/price/ecostar-55-inch-55ud925-led-tv", "price": "Rs. 1,16,570", "image_link": "/public/data/images/thumbs/1548963887b597f3a7da1f6ac3ce9857a1eeb06bbd.jpg", "description": "Ecostar 55UD925 is a big-screen television that comes with Ecostar Vero 4K UHD technology due to which, image quality is enhanced by 4x that of a full HD display. This Android LED TV includes all Android features including Facebook and YouTube for online entertainment. The 55UD925 also comes with its own smart system to further enhance accessibility, and hence your experience. With precision black technology, each frame gives a sharp contrast of all different colors, also neatly revealing different shades of black. Its Quadcore processing engine also plays fast moving images smoothly."},
{"name": "TCL 55 C8 LED TV", "link": "/price/tcl-55-c8-led-tv", "price": "Rs. 1,16,300", "image_link": "/public/data/images/thumbs/087f574909bd3804aad003e3a557c427.jpg", "description": "The TCL 55 C8 is a new addition in its famed Zalmi LED TV series and a beast of a screen. The 4K UHD fullscreen bezel-less display is a treat to watch your favorite stuff on even from YouTube, Netflix and such with HDR 10+. It has an integrated Onkyo sound bar and has the Dolby Atmos to give you theatrical sound and vision experience. It uses Micro Dimming to adjust brightness and contrast at micro level and gives an amazing picture. Its also laced with far field voice control to top it all off."},
{"name": "Samsung 50 Inches 50TU7000 LED TV", "link": "/price/samsung-50-inches-50tu7000-led-tv", "price": "Rs. 1,12,499", "image_link": "/public/data/images/thumbs/e3ca1c3a2b87bec6d12a3f37af2b4a32.jpg", "description": "50TU7000 is one of the best UHD LED TVs from Samsung having a screen size of 50 inches. This TV comes with exciting features of 4K resolution, Crystal Display, 3-side boundless design, Crystal processor 4K, HDR, Game Enhancer, and more. You will enjoy a crisp and clear image with Crystal Display and Crystal Processor 4K ensures powerful picture quality. The 4K UHD resolution of your LED TV provides sharp, crisp, and lifelike images by offering 4x more pixels than regular FHD. Moreover, High Dynamic Range ensures an immense spectrum of colors so that you will enjoy tiny details even in the dark scenes. Clean Cable management of this LED TV reduces the clutter so you will fully enjoy your TV. Other Smart features include Amazon Alexa, AirPlay 2, Google Assistant, and Tap view."},
{"name": "Orient UHD-55M7000 LED TV", "link": "/price/orient-uhd-55m7000-led-tv", "price": "Rs. 1,08,000", "image_link": "/public/data/images/thumbs/1555966099e21a0359cb6762b0f8866ad9c63c95f0.jpg", "description": "A higher mid-range LED TV which is the predecessor of the popular Orient UHD-55M8010 LED TV. The range of features on the UHD-55M7000 include Smart TV support for YouTube and Facebook, HDR technology, a powerful 4K streaming engine with Dolby-enhanced sound, and USB + HDMI connectivity. The UHD-55M7000 is a suitable choice for people looking for a UHD LED TV at an affordable price."},
{"name": "PEL 55 SMART Ultra HD LED TV", "link": "/price/pel-55-smart-ultra-hd-led-tv", "price": "Rs. 1,07,317", "image_link": "/public/data/images/thumbs/baabb213abc4f03c7a57cd01f72982e6.jpg", "description": "PEL's ColorOn 55 Smart is a large, beautiful LED TV with a 4K UHD resolution to satisfy your watching desires. The display and sound both are great and the Smart features & HDMI connectivity lets you watch all your stuff in 4K UHD. It has Dolby Audio system to give you a great theatrical sound experience."},
{"name": "Samsung 43 Inch 43RU7100 LED TV", "link": "/price/samsung-43-inch-43ru7100-led-tv", "price": "Rs. 1,06,469", "image_link": "/public/data/images/thumbs/9f38bc77f8a8ad191d33f9b56f58a4ae.jpg", "description": "43RU7100 LED TV is a 4K UHD LED TV from Samsung that comes with Wireless, Bluetooth, HDMI, and USB connections. It has a screen size of 43 inches. With 4K UHD resolution, every show, season, and scene is upscaled with enhanced picture clarity and a smart guide enables you to quickly find what you want to watch. You will see shades of colors that reveal more detail than HD TV can deliver. It provides smooth action on fast-moving objects. Enjoy your favorite media in 43RU7100 LED TV via HDMI and USB connections. All the more, the on-screen guide provides an easy way to find streaming content and live TV shows. 43RU7100 LED TV has a slim and elegant design for a modern look you'll admire. In short, this LED TV is a good choice with all of these amazing features."},
{"name": "TCL 50 inch 50C725 QLED TV", "link": "/product/34843673/7e8b8096e47dca7840cb28da92feca5a?query=TEVEIFRW&position=149", "price": "Rs. 1,24,900", "image_link": "https://cdn.pakistanistores.com/data/ays/thumbs//733f36c2753b496d7709c92109dec778.png", "description": "QLED UHD Android TV RT51 Platform CPU 64-bit A55 4 ~1.3 GHz GPU G31x2 800MHz OS Android R RAM/ROM DDR3-1866: 2G Bytes UI Style Android TV UI & TCL TV+ 3.x UI Power Consumption 145 W Certification CB, Dolby Audio, Dolby Vision, HDMI, DTS-HD, CTS (Google Official Certification), Netflix"},
{"name": "Samsung 49 Inch 49RU7100 LED TV", "link": "/price/samsung-49-inch-49ru7100-led-tv", "price": "Rs. 1,05,000", "image_link": "/public/data/images/thumbs/8941238c37bc9cc878d952d7620363c0.jpg", "description": "49RU7100 LED TV is a flat, Smart, 4K UHD LED TV from Samsung, a renowned brand in electronics. It comes with numerous exciting features for your extreme satisfaction. PurColor technology lets you enjoy your favorite content with natural colors and delivers details as crisp as the real things. With HDR, you will watch the content with better clarity in bright and dark scenes. You can now talk to QLED. Bixby is the intelligent assistant to your needs that goes beyond controlling your TV. Its slim and modern design adds beauty to your interior. Enjoy seamless connections with your Samsung LED TV. It works with Google Assistant to make your life easier by allowing you to adjust volume and change channels with just your voice. All the more, you can effortlessly play videos, music, and photos from Apple devices to your 49RU7100 LED TV s big screen with AirPlay 2 built-in."},
{"name": "TCL 50C716 LED TV", "link": "/price/tcl-50c716-led-tv", "price": "Rs. 1,02,500", "image_link": "/public/data/images/thumbs/458537af0e36ae0503b20d43ddfb2edf.jpg", "description": "Equipped with the latest technologies, 50C716 is one of the best 4K LED TVs available in the market today. Its main features include Quantum Dot technology, hands-free control, IPA engine, Dolby Vision, Dolby Atmos, HDR 10+, Full-Screen design, 4K UHD resolution, Bluetooth, Chromecast built-in, AI technology, Google Play Store, Google Assistant, Netflix, YouTube, and more. The Quantum Dot technology enhances the vibrancy of images and provides industry-leading color and brightness. The 4K resolution of your TCL LED TV provides a truly immersive and detailed viewing experience. The Dolby vision increases contrast and boosts brightness levels hence provides the finest picture quality. IPQ engine makes the picture more layered and ensures richer content. Micro dimming enhances contrast, especially in dark. The Dolby Atmos improves sound quality to give you an immersive sound experience. An exclusive feature of TCL LED TV is Magiconnect. This feature allows you to control your TV from your smartphone."},
{"name": "TCL 55P735 55 Andoid UHD LED TV", "link": "/product/34843557/9910dfeda4667d81bcce25ad2923591b?query=TEVEIFRW&position=140", "price": "Rs. 1,13,900", "image_link": "https://cdn.pakistanistores.com/data/ays/thumbs//d1d5e4bd3c77fa4ab9174da474b1dc25.png", "description": "Size: 55  Product Type: LED UHD Android TV Chassis: RT51 M Platform CPU: 64-bit A55 4~1.3GHz GPU: G31x2 800MHz OS: Android R RAM/ROM: DDR3-1866: 2G Bytes UI Style: Android TV UI & TCL TV UI Power Consumption: 85W Certification: CB, Dolby Audio, Dolby Vision, HDMI , CTS (Google Official Certification), Netflix"},
{"name": "ORIENT ACTION-55INCH SMART & 4K UHD", "link": "/product/32758732/98f24a8a49abfb752c49c608025ba5e9?query=TEVEIFRW&position=145", "price": "Rs. 1,19,999", "image_link": "https://cdn.pakistanistores.com/data/daredevil/thumbs//363adcf3cc2e26f747524d4f016179d6.png", "description": "Latest of ORIENT ACTION-55INCH SMART & 4K UHD in Pakistan is 119,999 PKR updated recently on August 2022. Basic specification is 4K UHD,  HDR (High Dynamic Range),  Smart TV (Youtube, Internet Browsing e.t.c), 55,."},
{"name": "TCL 50P715 LED TV", "link": "/price/tcl-50p715-led-tv", "price": "Rs. 98,890", "image_link": "/public/data/images/thumbs/9e7c15bd91eaf2f6d205284211b4296f.png", "description": "50P715 is one of the LED TVs from the P715 series offered by TCL with a screen size of 50 inches. This TV comes equipped with innovative features of 4K UHD resolution, Chromecast built-in, HDR 10+, Dolby Audio, Rich Color, Netflix, YouTube, Google Assistant, 4K upscaling, the latest Android OS, micro dimming, Magiconnect, Bluetooth, and much more. With 4K resolution, you will enjoy an immersive viewing experience. Rich color expansion is exclusively designed by TCL that optimizes color vibrancy, giving you a more vibrant video experience. With micro dimming technology, you will enjoy great contrast even in dark. Dolby Audio lets you enjoy a more realistic sound experience with crystal clarity and fine detail. With Google Assistant and Bluetooth, you will enjoy a hands-free TV experience as you can use your voice to access and control content. Moreover, YouTube and Netflix built-in let you watch your favorite programs and videos in 4K UHD resolution."},
{"name": "Samsung 43 AU7000 4K Smart LED TV", "link": "/price/samsung-43-au7000-4k-smart-led-tv", "price": "Rs. 98,700", "image_link": "/public/data/images/thumbs/5518f629d5d438b529c8474706116e30.jpg", "description": "Enjoy sharp and crisp images with Samsung 43 AU7000 4K Smart LED TV that goes beyond FHD and shows the smallest details in the scene. With q-symphony tv and soundbar speakers operate simultaneously giving you a better sound experience. A sleek, elegant, and boundless design makes your Samsung UHD LED TV more attractive. Clean Cable Solution reduces clutter and gives a seamless and tidy look. Moreover, you can mirror your mobile screen to your TV as simple as a tap. HDR allows you to see the details even in dark scenes. Furthermore, Crystal Processor 4K lets you experience more lifelike color expressions."},
{"name": "TCL P725 55INCH SMART & 4K LED TV", "link": "/product/31569248/39ef4e7974c332d60c26690bd860fa4f?query=TEVEIFRW&position=144", "price": "Rs. 1,19,499", "image_link": "https://cdn.pakistanistores.com/data/daredevil/thumbs//e3afaa69be062afcb65d0d7421c0d67a.png", "description": "Latest of TCL P725 55INCH SMART & 4K LED TV in Pakistan is 119,499 PKR updated recently on August 2022. Basic specification is 4K UHD,  HDR (High Dynamic Range),  Smart TV (Youtube, Internet Browsing e.t.c), 55,."},
{"name": "Akira 55MS507 LED TV", "link": "/price/akira-55ms507-led-tv", "price": "Rs. 83,900", "image_link": "/public/data/images/thumbs/16c455ddec3c3ab551b67baa80aba716.jpg", "description": "The Akira 55 MS507 is large, sleek, pretty display that catches your eye as soon as you go in the room. It has an Ultra HD resolution so you can watch your favorite stuff from YouTube, Netflix and other sources in the best quality that is pleasing to your eyes. Its great Sound bar contributes in giving you a theatrical experience. It also has a built in Satellite receiver to go with all the other amazing stuff."},
{"name": "Samsung 43AU7000 UHD 4K 43 Inch Smart LED TV", "link": "/product/32412383/8e77270690e9feb3bac6aceb34585ec0?query=TEVEIFRW&position=129", "price": "Rs. 99,999", "image_link": "https://cdn.pakistanistores.com/data/daredevil/thumbs//6cf814e3b3cd737e289db120e01f0346.png", "description": "Latest of Samsung 43AU7000 UHD 4K 43 Inch Smart LED TV in Pakistan is 99,999 PKR updated recently on August 2022. Basic specification is 4K UHD,  HDR (High Dynamic Range),  Smart TV (Youtube, Internet Browsing e.t.c), 43,."},
{"name": "TCL P8 55", "link": "/product/31521875/1c100a2b890554b871fa67ac54542e3b?query=TEVEIFRW&position=130", "price": "Rs. 99,999", "image_link": "https://cdn.pakistanistores.com/data/daredevil/thumbs//c152aff0965dbf686134cf394f31fb55.png", "description": "Latest of TCL P8 55 in Pakistan is 99,999 PKR updated recently on August 2022. Basic specification is 4K UHD,  Smart TV (Youtube, Internet Browsing e.t.c), 55,."},
{"name": "Hisense 55A7400F 55 4K Android Smart LED TV", "link": "/product/34843549/18ce3557cfea03c6e34436866b932003?query=TEVEIFRW&position=133", "price": "Rs. 1,02,600", "image_link": "https://cdn.pakistanistores.com/data/ays/thumbs//cb41ef68799bfc359497dd6f50b9472b.jpg", "description": "Android Operating System 4K UHD Bluetooth Voice Remote 26 Watts Speaker Digital Tuner Chromecast Builtin"},
{"name": "TCL 50 P615 4K Android LED TV", "link": "/price/tcl-50-p615-4k-android-led-tv", "price": "Rs. 81,000", "image_link": "/public/data/images/thumbs/abec768313267e283ca9fbccded0d8fd.jpg", "description": "TCL 50-inch P615 has a dynamic 4K display and color that enhances the experience of viewers. The stunning design can give users an immersive feeling while watching TB and the 4k upscaling features optimize the 2K content to 4K.It is powered by AI technology while giving you a cinematic experience in sound and picture quality. It is equipped with HDR10 Display, Chromecast built-in function, Google Assistant, Micro Dimming, and Dolby audio sound. The dynamic tone mapping optimizes picture quality to boost entertainment, enabling users to enjoy nuanced content."},
{"name": "EcoStar CX-50UD961 A+ 50 inch UHD Smart 4K LED TV", "link": "/product/34843521/b57c9211b4cfdbfc5dd3d7d0c97b2369?query=TEVEIFRW&position=121", "price": "Rs. 95,200", "image_link": "https://cdn.pakistanistores.com/data/ays/thumbs//9e22e51e7b46d010ef294792122ed51a.jpg", "description": "Screen Size: 50  4k UHD TV Resolution: 3840 x 2160 Power Consumption: 150W Android Smart LED TV Frameless Design Chrome Cast Built-in Bluetooth 5.0 Android 10.0 Built-in Wi-Fi/LAN USB Connectivity HDMI Input: 2 RAM: 2 GB ROM: 8 GB HDMI & ARC Built in Google Play Store"},
{"name": "TCL P725 50INCH SMART & 4K LED TV", "link": "/product/31569247/d9960bbe4f9bf1ced9151f7ed646a1e8?query=TEVEIFRW&position=134", "price": "Rs. 1,04,899", "image_link": "https://cdn.pakistanistores.com/data/daredevil/thumbs//54556d65fe04c8c2d06914936b66d26a.png", "description": "Latest of TCL P725 50INCH SMART & 4K LED TV in Pakistan is 104,899 PKR updated recently on August 2022. Basic specification is 4K UHD,  HDR (High Dynamic Range),  Smart TV (Youtube, Internet Browsing e.t.c), 50,."},
{"name": "SAMSUNG UA43T5300AUXTW 43 INCH SMART & 4K", "link": "/product/30102714/57d9131c88fc9d5ed1e618bad82a3953?query=TEVEIFRW&position=125", "price": "Rs. 97,999", "image_link": "https://cdn.pakistanistores.com/data/daredevil/thumbs//037e98d43ed6733829908ebb7b10fecd.png", "description": "Latest of SAMSUNG UA43T5300AUXTW 43 INCH SMART & 4K in Pakistan is 97,999 PKR updated recently on August 2022. Basic specification is 4K UHD,  HDR (High Dynamic Range),  Smart TV (Youtube, Internet Browsing e.t.c), 43,."},
{"name": "CHANGHONG RUBA L55H7NI 55 Inches UHD 4K SMART LED TV", "link": "/product/31332334/170f399c49e32d9f0f5811d658b37f27?query=TEVEIFRW&position=123", "price": "Rs. 97,999", "image_link": "https://cdn.pakistanistores.com/data/daredevil/thumbs//33d8c7738fa63b8e27517ab8d77de9c1.png", "description": "Latest of CHANGHONG RUBA L55H7NI 55 Inches UHD 4K SMART LED TV in Pakistan is 97,999 PKR updated recently on August 2022. Basic specification is 4K UHD,  HDR (High Dynamic Range),  Smart TV (Youtube, Internet Browsing e.t.c), 55,."},
{"name": "EcoStar CX-50UD961 50inch UHD Smart 4K LED TV", "link": "/product/30565409/73081ef643de3f6fe0f33c682247285c?query=TEVEIFRW&position=128", "price": "Rs. 99,999", "image_link": "https://cdn.pakistanistores.com/data/daredevil/thumbs//cc2da0247f8fd032108e21038891f7d7.png", "description": "Latest of EcoStar CX-50UD961 50inch UHD Smart 4K LED TV in Pakistan is 99,999 PKR updated recently on August 2022. Basic specification is 4K UHD,  HDR (High Dynamic Range),  Smart TV (Youtube, Internet Browsing e.t.c), 50,."},
{"name": "Samsung 43 Inch LED TV UA43-T5300", "link": "/product/34843501/a69301a7689d12ee703ff06b862670f5?query=TEVEIFRW&position=106", "price": "Rs. 83,200", "image_link": "https://cdn.pakistanistores.com/data/ays/thumbs//8adf51d4c8155d5011a961fd59dbb6c6.jpg", "description": "Screen Size: 43 inch LED Full HD Samsung Smart TV Resolution: 1920 x 1080 OS: Tizen  USB: 1 HDMI: 2 Smart Hub & One Remote Function HDR PurColor Ultra Clean View Contrast Enhancer Google Assistant Dolby Digital Plus Mobile to TV   Mirroring, DLN WiFi Direct Wireless LAN: WiFi4 Auto Power Off"},
{"name": "EcoStar 49 Inch 49U571 LED TV", "link": "/price/ecostar-49-inch-49u571-led-tv", "price": "Rs. 79,110", "image_link": "/public/data/images/thumbs/1548963038d8a23d97e265aff4baac6a2903ddadbf.jpg", "description": "Another budget television set, Ecostar s LED TV provides a Full HD display. With an A grade panel, real color engine, and a Motion engine technology, experience smooth and sharp quality pictures and videos. With digital voice reduction, the sound quality is also very good. Ecostar 49U571 has an energy efficient technology, keeping the consumption cost low. For ease of access, this set has a wide angle view and features like sleep timer too."},
{"name": "Sony 40 Inch 40W652D LED TV", "link": "/price/sony-40-inch-40w652d-led-tv", "price": "Rs. 77,999", "image_link": "/public/data/images/thumbs/15492040076ebde75379376f4f506069279981f224.jpg", "description": "The Sony 40W652D is a higher midrange LED TV that has advanced features such as X-Protection Pro, X-Reality Pro, and Live Color technology Even though it is not a smart TV, the excellent connectivity options that support USB, HDMI, and smartphone connectivity ensure that you can stream your favorite movies and TV shows on the LED TV. The Dolby Digital audio system ensures that you have a clear, natural audio playback when watching TV. The picture quality is superb and the Live Color technology ensures that the Sony 40W652D delivers vibrant colors and excellent contrast."},
{"name": "TCL LED TV 50 Inch 50P615", "link": "/product/34843486/68a01ee962cb8555449390e017cb48a2?query=TEVEIFRW&position=105", "price": "Rs. 82,990", "image_link": "https://cdn.pakistanistores.com/data/ays/thumbs//cc119c5733ff20e7c69bbf899c5f50e8.jpg", "description": "50 in, LED TV Wifi, Ethernet Smart TV 2 Speakers, 24 w Output 178   Viewing Angle 3 HDMI Ports, 2 USB Ports"},
{"name": "EcoStar CX-55UD963 A+ 55 4K UHD LED TV", "link": "/product/34843529/7496bcb4827e1c0c29f0eb1da4b1059b?query=TEVEIFRW&position=122", "price": "Rs. 96,500", "image_link": "https://cdn.pakistanistores.com/data/ays/thumbs//1fdf2c848556f8172ba07bd584aa727e.png", "description": "Latest Android 11 Enjoy the world of IoT with Google Assistant Unlimited Applications Flawless Connectivity Bluetooth 5.1 Built-in Chrome Cast Picture Perfect One Touch Access Quadcore Processor Gives Ultra Smooth Gaming Experience"},
{"name": "Haier 50U6900 50inch SMART LED", "link": "/product/30553539/4851099696e0647a16f34e7ec5179fd8?query=TEVEIFRW&position=107", "price": "Rs. 83,499", "image_link": "https://cdn.pakistanistores.com/data/daredevil/thumbs//35f5e407789f28ad9741423a5a790db1.png", "description": "Latest of Haier 50U6900 50inch SMART LED in Pakistan is 83,499 PKR updated recently on August 2022. Ultra HD has a resolution of 3840*2160 which shows clearer, smoother pictures with real-life details"},
{"name": "TCL P715 50inches Ultra HD 4K LED TV", "link": "/product/30553541/55a97e596535e86b993c65df4708d9cb?query=TEVEIFRW&position=124", "price": "Rs. 97,999", "image_link": "https://cdn.pakistanistores.com/data/daredevil/thumbs//0e09c9dee16f79d65f3eb020e82acbe3.png", "description": "Latest of TCL P715 50inches Ultra HD 4K LED TV in Pakistan is 97,999 PKR updated recently on August 2022. Basic specification is 4K UHD,  HDR (High Dynamic Range),  Smart TV (Youtube, Internet Browsing e.t.c), 50,."},
{"name": "EcoStar 42 CX-42U863 Smart LED TV", "link": "/price/ecostar-42-cx-42u863-smart-led-tv", "price": "Rs. 69,999", "image_link": "/public/data/images/thumbs/975a4d05f60780bcad80c0618101945e.png", "description": "Launched in the month of October 2021, this 42-inches LED by EcoStar provides its users with a cinematic experience from the comfort of their homes. It has many features that include a screen resolution of 1920 x 1080, 768 MB RAM, 4 GB ROM, and a Quad-core CPU. Along with these features, it also has 2 USB ports and Bluetooth. Like other Smart LED TVs, it also has a set of preinstalled features that include YouTube, Netflix, Google Play, Google Assistant as well as Amazon prime video. To enhance customers  trust in the product, it comes with a 1-year brand warranty."},
{"name": "Akira 50MS502 LED TV", "link": "/price/akira-50ms502-led-tv", "price": "Rs. 73,700", "image_link": "/public/data/images/thumbs/df4578dac2b5f33e8c7663a39010817f.jpg", "description": "The 50 MS502 is a Smart LED TV from Akira. It has a Full HD resolution to give you a fine display and Android OS to support apps such as Netflix and YouTube. You can watch shows and videos or anything from your other devices by connecting them through HDMI or phone mirroring and with built-in sound bar, you really do get a pleasing experience."},
{"name": "Akira 55MU007 LED TV", "link": "/price/akira-55mu007-led-tv", "price": "Rs. 69,999", "image_link": "/public/data/images/thumbs/15559649054d880f99cfd95dbd2900b1da367db1ac.jpg", "description": "The Akira 55MU007 is a higher mid-range LED TV that sports a sizeable 55-inch display with an impressive 4K streaming engine. The highlights of the 55MU007 from Akira are its built-in woofer system, excellent image quality, and value for money. At a competitive price, the Akira 55MU007 provides a smooth viewing experience with excellent colors and great contrast which is suitable for streaming your favorite TV shows, movies, and games in UHD resolution."},
{"name": "TCL 43 inch 4K Smart LED TV 43P725", "link": "/product/34843468/9a4f2ca7d04b3fa64fea2230b31e1f6d?query=TEVEIFRW&position=100", "price": "Rs. 77,900", "image_link": "https://cdn.pakistanistores.com/data/ays/thumbs//4e54aa5a63ceb6f76bc4204991e02198.jpg", "description": "4K HDR professional audiovisuals MEMC picture processing for smoother sports Dolby Vision / Atmos give TV and movie viewers a more immersive experience Powered by a TCL AiPQ Engine Chipset to ensure every frame is presented perfectly. Hands-Free Voice Control 2.0 Built-in microphones Metal-like texture Ultimate audio-visual experience"},
{"name": "TCL 43P735 43 Andoid UHD LED TV", "link": "/product/34843465/10d9d596687bb67bccf42d68297e91ec?query=TEVEIFRW&position=99", "price": "Rs. 76,900", "image_link": "https://cdn.pakistanistores.com/data/ays/thumbs//d1d5e4bd3c77fa4ab9174da474b1dc25.png", "description": "Size: 43  Product Type: LED UHD Android TV ChassisRT51: M Platform CPU: 64-bit A55 4~1.3GHz GPU: G31x2 800MHz OS: Android R RAM/ROM: DDR3-1866: 2G Bytes UI Style: Android TV UI & TCL TV UI Power Consumption: 85W Certification: CB, Dolby Audio, Dolby Vision, HDMI , CTS (Google Official Certification), Netflix"},
{"name": "EcoStar CX - 50UD940A 4K UHD Smart LED TV", "link": "/price/ecostar-cx-50ud940a-4k-uhd-smart-led-tv", "price": "Rs. 67,900", "image_link": "/public/data/images/thumbs/c6b8a4e6ea82fb47700ed4a723bff57e.jpg", "description": "EcoStar CX - 50UD940A is a Smart LED TV with Built-in connectivity streaming apps such as Netflix, YouTube Netrange that lets you explore the world of entertainment. Its 4K Ultra HD Display with 3840 x 2160 image resolution gives an amazingly colorful viewing experience and is perfect for gaming visuals. Its seamless picture quality with the help of Quad Core GPU, powerful contrast, deep black richness and superb clarity enriches the viewing experience. the Dolby Audio System equipped with this TV creates clear and loud sound and its slim body enhance your interior design."},
{"name": "TCL 43 P615 4k Android LED TV", "link": "/price/tcl-43-p615-4k-android-led-tv", "price": "Rs. 65,500", "image_link": "/public/data/images/thumbs/", "description": "This 43-inch 4K LED which belongs to the P615 Series has many features that together make it a worthwhile purchase. With 4K Ultra HD resolution, it has dynamic color enhancement and a high dynamic range. To make sure the viewers are never bored and always have something or the other to watch and keep themselves entertained, it provides them with unlimited entertainment content. This includes Netflix, YouTube, Prime Video, Zee5, Jio Saavn as well as Spotify among others. Moreover, it has 4K upscaling, micro dimming, super-narrow bezels, and Dolby audio. With smart home interconnectivity, it has Voice Remote, Google Assistant as well as built-in Bluetooth."},
{"name": "Sony 40 Inch 40R352E LED TV", "link": "/price/sony-40-inch-40r352e-led-tv", "price": "Rs. 64,999", "image_link": "/public/data/images/thumbs/15492039221e89461df6996e4261baf58ef864213a.jpg", "description": "The Sony 40R352E is a midrange LED that is focused on providing an all-round viewing experience. The beautiful, thin-bezel design is backed with the X-Protection Pro technology that protects the LED from dust and humidity. As for image quality, the X-Reality Engine on the Sony 40R352E delivers an excellent viewing experience with good colors, great contrast, and adequate brightness. The Sony 40R352E supports USB, HDMI, and smartphone connectivity with screen mirroring that enables you to play your favorite movies, TV shows, and games on the LED TV."},
{"name": "EcoStar CX-43UD963 A+ 43 4K LED TV", "link": "/product/34843415/2674f25859fe4ba0e631b5c166a54b25?query=TEVEIFRW&position=94", "price": "Rs. 69,500", "image_link": "https://cdn.pakistanistores.com/data/ays/thumbs//9a5bcda906cba9b486abe55b2ba735fd.png", "description": "Latest Android 11 Enjoy the world of IoT with Google Assistant Unlimited Applications Flawless Connectivity Bluetooth 5.1 Built-in Chrome Cast Picture Perfect One Touch Access Quadcore Processor Gives Ultra Smooth Gaming Experience"},
{"name": "TCL 43 INCH 4K HDR TV P725", "link": "/product/33629416/1f5022ad6e60157492d9d78dc533a576?query=TEVEIFRW&position=98", "price": "Rs. 73,900", "image_link": "https://cdn.pakistanistores.com/data/daredevil/thumbs//6b567b13efd92ddb265fe7c8773c94c4.png", "description": "Latest of TCL 43 INCH 4K HDR TV P725 in Pakistan is 73,900 PKR updated recently on August 2022. Basic specification is 4K UHD,  HDR (High Dynamic Range),  Smart TV (Youtube, Internet Browsing e.t.c), 43-Inch,."},
{"name": "Samsung 49 Inch 49M5000 LED TV", "link": "/price/samsung-49-inch-49m5000-led-tv", "price": "Rs. 64,989", "image_link": "/public/data/images/thumbs/fa2a17d9abc97472a4f494c8db20bbc8.jpg", "description": "Enjoy a crisp clear Full HD picture with Samsung 49 inch M5000 LED TV. Digital Clean View improves the quality of the blurry TV picture and displays it with impressive quality. Uncover hidden details and see colors as they were meant to be seen because of Wide Color Enhancer technology. Connect your laptop with your TV through HDMI ports and enjoy your favorite digital media on your TV's big-screen through a USB connection."},
{"name": "SAMSUNG 40 Inch N5300 Series 5 Flat Smart Full HD TV", "link": "/product/32741466/9027e0f23f5a6b088fc10dbdf0b78740?query=TEVEIFRW&position=103", "price": "Rs. 79,999", "image_link": "https://cdn.pakistanistores.com/data/daredevil/thumbs//e3868a6db03567eb93573b9fbb382e45.png", "description": "Latest of SAMSUNG 40 Inch N5300 Series 5 Flat Smart Full HD TV in Pakistan is 79,999 PKR updated recently on August 2022. Basic specification is FHD,  HDR (High Dynamic Range),  Smart TV (Youtube, Internet Browsing e.t.c), 40,."},
{"name": "Samsung 40 Inch 40N5000 LED TV", "link": "/price/samsung-40-inch-40n5000-led-tv", "price": "Rs. 64,499", "image_link": "/public/data/images/thumbs/9edac7db3364c5caa3158045e107de0f.png", "description": "Enjoy everything with refined image quality in Samsung 40 Inch 40N5000 LED TV. It comes with FHD resolution to provide a crisp and clear viewing experience. Wide Color Enhancer improves the quality of the image while Clean View reduces noise and interference, hence giving a crystal clear image view. Dolby sound system improves the quality of sound so you will enjoy a good hearing experience. USB connection lets you enjoy your favorite videos, music, and photos. In short, this LED TV is a budget-friendly TV with all of these exciting features."},
{"name": "Ecostar 43 CX-43UD961 4K Android LED TV", "link": "/price/ecostar-43-cx-43ud961-4k-android-led-tv", "price": "Rs. 63,999", "image_link": "/public/data/images/thumbs/d3151462e3f350e6c67f164db49ee668.jpg", "description": "This 4K android LED TV has many distinct and unique features to look out for. These features and specifications include a screen resolution of 3840 x 2160 which provides its users with a theatrical experience from the comfort of their homes. When it comes to connectivity, it has various ports and options that allow you to watch anything you wish to on your LED TV. Its ports include 2 USB ports, 2 HDMI ports as well as HDMI and ARC. Along with this, it has an in-built google play store, smart home connectivity, chrome cast, and enhanced images all of which work together to make customers  experience better."},
{"name": "HAIER 40INCH SMART LE-40K6600", "link": "/product/30102703/15641a03c76d78ccbbdb8b88ac92223d?query=TEVEIFRW&position=93", "price": "Rs. 68,999", "image_link": "https://cdn.pakistanistores.com/data/daredevil/thumbs//668c9b96e56b038b7a4ea428db831dcf.png", "description": "Latest of HAIER 40INCH SMART  LE-40K6600 in Pakistan is 68,999 PKR updated recently on August 2022. Basic specification is 4K UHD,  HDR (High Dynamic Range),  Smart TV (Youtube, Internet Browsing e.t.c), 40,."},
{"name": "EcoStar 32 CX-32U862 Android LED TV", "link": "/price/ecostar-32-cx-32u862-android-led-tv", "price": "Rs. 35,999", "image_link": "/public/data/images/thumbs/34d34c7969e61d034e00537edf9b689a.png", "description": "This 32-inch LED has many features that make it a cost-effective purchase for its users. These features include built-in Netflix, YouTube, Facebook Watch, and Twitter. With quad-core GPU, it also has USB connectivity of 2.0, HDMI and ARC of HDMI 1.4(HDCP 1.4), and EPG. It has an amazing screen and sound quality with real color engine, digital noise reduction, and Dolby sound. Along with all these, it has a wide color enhancer, Teletext as well as contrast enhancer. Other features include a built-in power cable, remote control, and wall mount bracket. To make things easier for the users, it comes with a user s manual."},
{"name": "EcoStar 40 Inch 40U561 LED TV", "link": "/price/ecostar-40-inch-40u561-led-tv", "price": "Rs. 35,900", "image_link": "/public/data/images/thumbs/1549308753355a1348525546ec7fd0be45af208b62.jpg", "description": "EcoStar is known for its budget-friendly electronics and the EcoStar 40U561 is no exception to this. The popular EcoStar 40U561 LED TV comes with a Full HD resolution, HDR capability, and USB and HDMI connectivity all in one package. The picture quality is excellent with great contrast, largely because of EcoStar's RealColor Engine that amplifies and fine-tunes the source. You can connect the EcoStar 40U561 with various input sources to stream your favorite content, but it does lack the smart TV features that we are now accustomed to. However, despite this, the EcoStar 40U561 is one of the most feature-rich and high-performing LED TVs that you will find in this price."},
{"name": "PEL 32 Smart HD LED TV", "link": "/price/pel-32-smart-hd-led-tv", "price": "Rs. 35,490", "image_link": "/public/data/images/thumbs/355aa5dbbac28fda218a441c3105521d.jpg", "description": "PEL ColorOn 32 is a Smart LED TV with HD resolution. It is a budget and pretty basic LED but of good quality. It's smart features lets you watch YouTube and Netflix in HD quality and has the HDMI connectivity to connect your devices to play anything on a bigger display."},
{"name": "TCL LED TV 43 inch 43P615", "link": "/product/34843392/964779faff3c5368528aab197821cc3b?query=TEVEIFRW&position=87", "price": "Rs. 64,990", "image_link": "https://cdn.pakistanistores.com/data/ays/thumbs//9c32ff06581063a2a96347d73e82ea67.jpg", "description": "TCL Android OS HDR10 Display Micro Dimming Google Assistant Chromecast built-in function Dolby audio sound Different equalizer profiles 4K Ultra HD"},
{"name": "MULTY NET 43SU7 43INCH FHD SMART", "link": "/product/32758731/398a51d02b69e17b85beec3cca63ee50?query=TEVEIFRW&position=90", "price": "Rs. 66,899", "image_link": "https://cdn.pakistanistores.com/data/daredevil/thumbs//2a5f1cfe50af2da49347902d876845d3.png", "description": "Latest of MULTY NET 43SU7 43INCH FHD SMART in Pakistan is 66,899 PKR updated recently on August 2022. Basic specification is FHD,  Smart TV (Youtube, Internet Browsing e.t.c), 43,."},
{"name": "Samsung 32 Inch 32N5000 LED TV", "link": "/price/samsung-32-inch-32n5000-led-tv", "price": "Rs. 35,489", "image_link": "/public/data/images/thumbs/6ef3f6f956ef81cdc9dc19ebc664f225.jpg", "description": "32N5000 is one of the flat, non-smart LED TVs from Samsung having a screen size of 32 inches. It comes equipped with Full HD resolution, HDMI, and USB connectivity. Full HD resolution provides crisp and clear images Wide Color Enhancer improves the image quality and displays bright and rich colors with more detail. You can plug and play your favorite entertainment on this LED TV. Enjoy videos, music, and view photos through a USB connection. Moreover, Clean View in 32N5000 LED TV reduces noise and interference and lets you enjoy everything with refined quality."},
{"name": "EcoStar 32 Inch CX-32U568 LED TV", "link": "/price/ecostar-32-inch-cx-32u568-led-tv", "price": "Rs. 34,054", "image_link": "/public/data/images/thumbs/2b427a1f0549bcbbdd2eae452d4ff028.png", "description": "EcoStar is famous for its budget-friendly electronics and another one of the newest, budget-friendly, 32-inch LED TVs from EcoStar is the EcoStar CX-32U568 which comes with HD resolution and USB & HDMI connectivity all in one package. Real Color Engine, Motion Reality engine, and A-Grade panel make the picture quality smooth and sharp. Sound quality is also quite good because of digital voice reduction. This LED TV also offers a USB connection so that you can listen to MP3 songs and watch HD videos. HDMI availability offers you to project your personal computer or laptop screen on this TV. Moreover, its screen size is quite impressive. This LED TV lacks smart features and Full-HD resolution but it is a very high performing LED TV to consider in this price range."},
{"name": "Akira 32MG2023 LED TV", "link": "/price/akira-32mg2023-led-tv", "price": "Rs. 34,000", "image_link": "/public/data/images/thumbs/795dee2052652b35904ba7aba2474594.jpg", "description": "The MG2023 is another 32 LED TV by Akira. It has all the features of a budget LED such as HD display, HDMI connectivity to connect other devices and watching stuff. An average size, a beautiful design and built-in Sound bar also makes it a good catch."},
{"name": "TCL 43 Inch S65A Full HD Android Smart LED TV", "link": "/product/32534978/fc53c35395eb7d35f9adf495587a4e89?query=TEVEIFRW&position=85", "price": "Rs. 64,990", "image_link": "https://cdn.pakistanistores.com/data/daredevil/thumbs//35714aae48db5547b7406b4b9c7169e8.png", "description": "Latest of TCL 43 Inch S65A Full HD Android Smart LED TV in Pakistan is 64,990 PKR updated recently on August 2022. Basic specification is FHD,  HDR (High Dynamic Range),  Smart TV (Youtube, Internet Browsing e.t.c), 43-inch,."},
{"name": "Haier H42D6FG 42inch Smart Full HD LED", "link": "/product/30565404/06ee5cf54a497948c51aaf9e9260ec37?query=TEVEIFRW&position=83", "price": "Rs. 64,899", "image_link": "https://cdn.pakistanistores.com/data/daredevil/thumbs//85ac4d7a9e4d5614ab1cb2b852ad99ae.png", "description": "Latest of Haier H42D6FG 42inch  Smart Full HD LED in Pakistan is 64,899 PKR updated recently on August 2022. Basic specification is 4K UHD,  HDR (High Dynamic Range),  Smart TV (Youtube, Internet Browsing e.t.c), 42,."},
{"name": "EcoStar CX-43UD962 A+ 43 4K LED TV", "link": "/product/34843406/a39750c23a3ed80d91af82b317f1afb2?query=TEVEIFRW&position=92", "price": "Rs. 68,500", "image_link": "https://cdn.pakistanistores.com/data/ays/thumbs//955471fe47363e857473e21a841c8c04.png", "description": "Latest Android 11 Enjoy the world of IoT with Google Assistant Unlimited Applications Flawless Connectivity Bluetooth 5.1 Built-in Chrome Cast Picture Perfect One Touch Access Quadcore Processor Gives Ultra Smooth Gaming Experience"},
{"name": "Orient 32 Blaze HD Black LED TV", "link": "/price/orient-32-blaze-hd-black-led-tv", "price": "Rs. 34,000", "image_link": "/public/data/images/thumbs/6b7f0a4567768db78e0c394effdb03be.jpg", "description": "This 32-Inch LED by Orient has many distinct features that make the purchase worthwhile. These features include a Full-screen display which boosts the screen resolution, a full-color optimizer that enables the users to see vivid and bright images on the screen as well as Dolby audio which enhances the sound quality. It has faster refresh rates as well as higher video resolutions all thanks to its feature of HDMI. The USB option enables the users to watch all the videos, images, and music they like. Along with this, it also has many different applications built-in."},
{"name": "EcoStar 32 Inch HD LED CX-32U871 A+", "link": "/product/34843139/e1251599cad5915f3eb10ddc83941b8a?query=TEVEIFRW&position=15", "price": "Rs. 29,500", "image_link": "https://cdn.pakistanistores.com/data/ays/thumbs//426a98cbec37bee40e109f007f0cf859.png", "description": "Built-in Netflix Screen Cast Dolby Sound Black Richness Streaming Applications Perfect Gaming Resolution One Button Access to Netflix & YouTube Core Graphic Processor"},
{"name": "Orient Trumpet 32S HD LED TV", "link": "/price/orient-trumpet-32s-hd-led-tv", "price": "Rs. 28,490", "image_link": "/public/data/images/thumbs/15559657479a05ea5225376cc7c09cefd8c9f217ac.jpg", "description": "An entry-level LED TV from Orient that features a 1080p streaming engine with an impressive 32-inch display that provides a smooth and comfortable viewing experience. Bundled with USB connectivity, HDMI connectivity, and Orient's own color enhancing technology, the Orient Trumpet 32S HD is a good choice to consider for a LED TV when you are on a budget."},
{"name": "EcoStar CX-32U573A+ Full HD LED TV 32 Inch", "link": "/product/34843134/5026aa8994c05cc12bb6cbee0aeeb08c?query=TEVEIFRW&position=14", "price": "Rs. 29,100", "image_link": "https://cdn.pakistanistores.com/data/ays/thumbs//2c316eacba266ddc7e51711070457404.png", "description": "Screen Size: 32  LED TV Resolution: 1366 x 768 (HD Ready) Power Consumption: 55W USB Connectivity HDMI Input: 2 Auto Power Off PC-Input Motion Engine Image Refinery Nature View Frameless Design DynaCon"},
{"name": "TCL S5200 43INCH SMART LED TV", "link": "/product/33240434/6ce0c5533d07578c8c26728037dfd310?query=TEVEIFRW&position=86", "price": "Rs. 64,990", "image_link": "https://cdn.pakistanistores.com/data/daredevil/thumbs//f42a8e528968d2605f6be37e03e0fb5b.png", "description": "Latest of TCL S5200 43INCH SMART LED TV in Pakistan is 64,990 PKR updated recently on August 2022. Basic specification is 2K,  HDR (High Dynamic Range),  Smart TV (Youtube, Internet Browsing e.t.c), 43,."},
{"name": "TCL Standard LED TV 32 Inches 32D310", "link": "/product/34843132/7d85823f6ee583c9dce4ba9a66cf018c?query=TEVEIFRW&position=13", "price": "Rs. 28,500", "image_link": "https://cdn.pakistanistores.com/data/ays/thumbs//98a34fbcacef294dca015b050b901180.jpg", "description": "32 Inches Standard LED HD Resolution Natural Light Engine Turbo Sound 1 USB/2 HDMI Inputs 1 Year Warranty"}
]